josuah/mcu-samd09/registers.h
/* generated from SVD file, then edited by hand */


#define ADC ((struct zmcu_adc *)0x42002000)

/* Analog Digital Converter */
struct zmcu_adc {

	/* 0x00: Control A */
	uint8_t volatile CTRLA;
	/* Software Reset */
#define ADC_CTRLA_SWRST				0u
	/* Enable */
#define ADC_CTRLA_ENABLE			1u
	/* Run in Standby */
#define ADC_CTRLA_RUNSTDBY			2u

	/* 0x01: Reference Control */
	uint8_t volatile REFCTRL;
	/* Reference Selection */
#define ADC_REFCTRL_REFSEL_lsb			0u
#define ADC_REFCTRL_REFSEL_msb			3u
#define ADC_REFCTRL_REFSEL_INT1V		0x0
#define ADC_REFCTRL_REFSEL_INTVCC0		0x1
#define ADC_REFCTRL_REFSEL_INTVCC1		0x2
#define ADC_REFCTRL_REFSEL_AREFA		0x3
#define ADC_REFCTRL_REFSEL_AREFB		0x4
	/* Reference Buffer Offset Compensation Enable */
#define ADC_REFCTRL_REFCOMP			7u

	/* 0x02: Average Control */
	uint8_t volatile AVGCTRL;
	/* Number of Samples to be Collected */
#define ADC_AVGCTRL_SAMPLENUM_lsb		0u
#define ADC_AVGCTRL_SAMPLENUM_msb		3u
#define ADC_AVGCTRL_SAMPLENUM_1			0x0
#define ADC_AVGCTRL_SAMPLENUM_2			0x1
#define ADC_AVGCTRL_SAMPLENUM_4			0x2
#define ADC_AVGCTRL_SAMPLENUM_8			0x3
#define ADC_AVGCTRL_SAMPLENUM_16		0x4
#define ADC_AVGCTRL_SAMPLENUM_32		0x5
#define ADC_AVGCTRL_SAMPLENUM_64		0x6
#define ADC_AVGCTRL_SAMPLENUM_128		0x7
#define ADC_AVGCTRL_SAMPLENUM_256		0x8
#define ADC_AVGCTRL_SAMPLENUM_512		0x9
#define ADC_AVGCTRL_SAMPLENUM_1024		0xA
	/* Adjusting Result / Division Coefficient */
#define ADC_AVGCTRL_ADJRES_lsb			4u
#define ADC_AVGCTRL_ADJRES_msb			6u

	/* 0x03: Sampling Time Control */
	uint8_t volatile SAMPCTRL;
	/* Sampling Time Length */
#define ADC_SAMPCTRL_SAMPLEN_lsb		0u
#define ADC_SAMPCTRL_SAMPLEN_msb		5u

	/* 0x04: Control B */
	uint16_t volatile CTRLB;
	/* Differential Mode */
#define ADC_CTRLB_DIFFMODE			0u
	/* Left-Adjusted Result */
#define ADC_CTRLB_LEFTADJ			1u
	/* Free Running Mode */
#define ADC_CTRLB_FREERUN			2u
	/* Digital Correction Logic Enabled */
#define ADC_CTRLB_CORREN			3u
	/* Conversion Result Resolution */
#define ADC_CTRLB_RESSEL_lsb			4u
#define ADC_CTRLB_RESSEL_msb			5u
#define ADC_CTRLB_RESSEL_12BIT			0x0
#define ADC_CTRLB_RESSEL_16BIT			0x1
#define ADC_CTRLB_RESSEL_10BIT			0x2
#define ADC_CTRLB_RESSEL_8BIT			0x3
	/* Prescaler Configuration */
#define ADC_CTRLB_PRESCALER_lsb			8u
#define ADC_CTRLB_PRESCALER_msb			10u
#define ADC_CTRLB_PRESCALER_DIV4		0x0
#define ADC_CTRLB_PRESCALER_DIV8		0x1
#define ADC_CTRLB_PRESCALER_DIV16		0x2
#define ADC_CTRLB_PRESCALER_DIV32		0x3
#define ADC_CTRLB_PRESCALER_DIV64		0x4
#define ADC_CTRLB_PRESCALER_DIV128		0x5
#define ADC_CTRLB_PRESCALER_DIV256		0x6
#define ADC_CTRLB_PRESCALER_DIV512		0x7

	/* 0x06 */
	uint8_t volatile RESERVED0[0x08-0x06];

	/* 0x08: Window Monitor Control */
	uint8_t volatile WINCTRL;
	/* Window Monitor Mode */
#define ADC_WINCTRL_WINMODE_lsb			0u
#define ADC_WINCTRL_WINMODE_msb			2u
#define ADC_WINCTRL_WINMODE_DISABLE		0x0
#define ADC_WINCTRL_WINMODE_MODE1		0x1
#define ADC_WINCTRL_WINMODE_MODE2		0x2
#define ADC_WINCTRL_WINMODE_MODE3		0x3
#define ADC_WINCTRL_WINMODE_MODE4		0x4

	/* 0x09 */
	uint8_t volatile RESERVED1[0x0C-0x09];

	/* 0x0C: Software Trigger */
	uint8_t volatile SWTRIG;
	/* ADC Conversion Flush */
#define ADC_SWTRIG_FLUSH			0u
	/* ADC Start Conversion */
#define ADC_SWTRIG_START			1u

	/* 0x0D */
	uint8_t volatile RESERVED2[0x10-0x0D];

	/* 0x10: Input Control */
	uint32_t volatile INPUTCTRL;
	/* Positive Mux Input Selection */
#define ADC_INPUTCTRL_MUXPOS_lsb		0u
#define ADC_INPUTCTRL_MUXPOS_msb		4u
#define ADC_INPUTCTRL_MUXPOS_PIN0		0x0
#define ADC_INPUTCTRL_MUXPOS_PIN1		0x1
#define ADC_INPUTCTRL_MUXPOS_PIN2		0x2
#define ADC_INPUTCTRL_MUXPOS_PIN3		0x3
#define ADC_INPUTCTRL_MUXPOS_PIN4		0x4
#define ADC_INPUTCTRL_MUXPOS_PIN5		0x5
#define ADC_INPUTCTRL_MUXPOS_PIN6		0x6
#define ADC_INPUTCTRL_MUXPOS_PIN7		0x7
#define ADC_INPUTCTRL_MUXPOS_PIN8		0x8
#define ADC_INPUTCTRL_MUXPOS_PIN9		0x9
#define ADC_INPUTCTRL_MUXPOS_PIN10		0xA
#define ADC_INPUTCTRL_MUXPOS_PIN11		0xB
#define ADC_INPUTCTRL_MUXPOS_PIN12		0xC
#define ADC_INPUTCTRL_MUXPOS_PIN13		0xD
#define ADC_INPUTCTRL_MUXPOS_PIN14		0xE
#define ADC_INPUTCTRL_MUXPOS_PIN15		0xF
#define ADC_INPUTCTRL_MUXPOS_PIN16		0x10
#define ADC_INPUTCTRL_MUXPOS_PIN17		0x11
#define ADC_INPUTCTRL_MUXPOS_PIN18		0x12
#define ADC_INPUTCTRL_MUXPOS_PIN19		0x13
#define ADC_INPUTCTRL_MUXPOS_TEMP		0x18
#define ADC_INPUTCTRL_MUXPOS_BANDGAP		0x19
#define ADC_INPUTCTRL_MUXPOS_SCALEDCOREVCC	0x1A
#define ADC_INPUTCTRL_MUXPOS_SCALEDIOVCC	0x1B
	/* Negative Mux Input Selection */
#define ADC_INPUTCTRL_MUXNEG_lsb		8u
#define ADC_INPUTCTRL_MUXNEG_msb		12u
#define ADC_INPUTCTRL_MUXNEG_PIN0		0x0
#define ADC_INPUTCTRL_MUXNEG_PIN1		0x1
#define ADC_INPUTCTRL_MUXNEG_PIN2		0x2
#define ADC_INPUTCTRL_MUXNEG_PIN3		0x3
#define ADC_INPUTCTRL_MUXNEG_PIN4		0x4
#define ADC_INPUTCTRL_MUXNEG_PIN5		0x5
#define ADC_INPUTCTRL_MUXNEG_PIN6		0x6
#define ADC_INPUTCTRL_MUXNEG_PIN7		0x7
#define ADC_INPUTCTRL_MUXNEG_GND		0x18
#define ADC_INPUTCTRL_MUXNEG_IOGND		0x19
	/* Number of Input Channels Included in Scan */
#define ADC_INPUTCTRL_INPUTSCAN_lsb		16u
#define ADC_INPUTCTRL_INPUTSCAN_msb		19u
	/* Positive Mux Setting Offset */
#define ADC_INPUTCTRL_INPUTOFFSET_lsb		20u
#define ADC_INPUTCTRL_INPUTOFFSET_msb		23u
	/* Gain Factor Selection */
#define ADC_INPUTCTRL_GAIN_lsb			24u
#define ADC_INPUTCTRL_GAIN_msb			27u
#define ADC_INPUTCTRL_GAIN_1X			0x0
#define ADC_INPUTCTRL_GAIN_2X			0x1
#define ADC_INPUTCTRL_GAIN_4X			0x2
#define ADC_INPUTCTRL_GAIN_8X			0x3
#define ADC_INPUTCTRL_GAIN_16X			0x4
#define ADC_INPUTCTRL_GAIN_DIV2			0xF

	/* 0x14: Event Control */
	uint8_t volatile EVCTRL;
	/* Start Conversion Event In */
#define ADC_EVCTRL_STARTEI			0u
	/* Synchronization Event In */
#define ADC_EVCTRL_SYNCEI			1u
	/* Result Ready Event Out */
#define ADC_EVCTRL_RESRDYEO			4u
	/* Window Monitor Event Out */
#define ADC_EVCTRL_WINMONEO			5u

	/* 0x15 */
	uint8_t volatile RESERVED3[0x16-0x15];

	/* 0x16: Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Result Ready Interrupt Enable */
#define ADC_INTENCLR_RESRDY			0u
	/* Overrun Interrupt Enable */
#define ADC_INTENCLR_OVERRUN			1u
	/* Window Monitor Interrupt Enable */
#define ADC_INTENCLR_WINMON			2u
	/* Synchronization Ready Interrupt Enable */
#define ADC_INTENCLR_SYNCRDY			3u

	/* 0x17: Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Result Ready Interrupt Enable */
#define ADC_INTENSET_RESRDY			0u
	/* Overrun Interrupt Enable */
#define ADC_INTENSET_OVERRUN			1u
	/* Window Monitor Interrupt Enable */
#define ADC_INTENSET_WINMON			2u
	/* Synchronization Ready Interrupt Enable */
#define ADC_INTENSET_SYNCRDY			3u

