josuah/mcu-samd09/registers.h
	/* 0x18: Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Result Ready */
#define ADC_INTFLAG_RESRDY			0u
	/* Overrun */
#define ADC_INTFLAG_OVERRUN			1u
	/* Window Monitor */
#define ADC_INTFLAG_WINMON			2u
	/* Synchronization Ready */
#define ADC_INTFLAG_SYNCRDY			3u

	/* 0x19: Status */
	uint8_t volatile const STATUS;
	/* Synchronization Busy */
#define ADC_STATUS_SYNCBUSY			7u

	/* 0x1A: Result */
	uint16_t volatile const RESULT;
	/* Result Conversion Value */
#define ADC_RESULT_RESULT_lsb			0u
#define ADC_RESULT_RESULT_msb			15u

	/* 0x1C: Window Monitor Lower Threshold */
	uint16_t volatile WINLT;
	/* Window Lower Threshold */
#define ADC_WINLT_WINLT_lsb			0u
#define ADC_WINLT_WINLT_msb			15u

	/* 0x1E */
	uint8_t volatile RESERVED4[0x20-0x1E];

	/* 0x20: Window Monitor Upper Threshold */
	uint16_t volatile WINUT;
	/* Window Upper Threshold */
#define ADC_WINUT_WINUT_lsb			0u
#define ADC_WINUT_WINUT_msb			15u

	/* 0x22 */
	uint8_t volatile RESERVED5[0x24-0x22];

	/* 0x24: Gain Correction */
	uint16_t volatile GAINCORR;
	/* Gain Correction Value */
#define ADC_GAINCORR_GAINCORR_lsb		0u
#define ADC_GAINCORR_GAINCORR_msb		11u

	/* 0x26: Offset Correction */
	uint16_t volatile OFFSETCORR;
	/* Offset Correction Value */
#define ADC_OFFSETCORR_OFFSETCORR_lsb		0u
#define ADC_OFFSETCORR_OFFSETCORR_msb		11u

	/* 0x28: Calibration */
	uint16_t volatile CALIB;
	/* Linearity Calibration Value */
#define ADC_CALIB_LINEARITY_CAL_lsb		0u
#define ADC_CALIB_LINEARITY_CAL_msb		7u
	/* Bias Calibration Value */
#define ADC_CALIB_BIAS_CAL_lsb			8u
#define ADC_CALIB_BIAS_CAL_msb			10u

	/* 0x2A: Debug Control */
	uint8_t volatile DBGCTRL;
	/* Debug Run */
#define ADC_DBGCTRL_DBGRUN			0u

};


#define DMAC ((struct zmcu_dmac *)0x41004800)

/* Direct Memory Access Controller */
struct zmcu_dmac {

	/* 0x00: Control */
	uint16_t volatile CTRL;
	/* Software Reset */
#define DMAC_CTRL_SWRST				0u
	/* DMA Enable */
#define DMAC_CTRL_DMAENABLE			1u
	/* CRC Enable */
#define DMAC_CTRL_CRCENABLE			2u
	/* Priority Level 0 Enable */
#define DMAC_CTRL_LVLEN0			8u
	/* Priority Level 1 Enable */
#define DMAC_CTRL_LVLEN1			9u
	/* Priority Level 2 Enable */
#define DMAC_CTRL_LVLEN2			10u
	/* Priority Level 3 Enable */
#define DMAC_CTRL_LVLEN3			11u

	/* 0x02: CRC Control */
	uint16_t volatile CRCCTRL;
	/* CRC Beat Size */
#define DMAC_CRCCTRL_CRCBEATSIZE_lsb		0u
#define DMAC_CRCCTRL_CRCBEATSIZE_msb		1u
#define DMAC_CRCCTRL_CRCBEATSIZE_BYTE		0x0
#define DMAC_CRCCTRL_CRCBEATSIZE_HWORD		0x1
#define DMAC_CRCCTRL_CRCBEATSIZE_WORD		0x2
	/* CRC Polynomial Type */
#define DMAC_CRCCTRL_CRCPOLY_lsb		2u
#define DMAC_CRCCTRL_CRCPOLY_msb		3u
#define DMAC_CRCCTRL_CRCPOLY_CRC16		0x0
#define DMAC_CRCCTRL_CRCPOLY_CRC32		0x1
	/* CRC Input Source */
#define DMAC_CRCCTRL_CRCSRC_lsb			8u
#define DMAC_CRCCTRL_CRCSRC_msb			13u
#define DMAC_CRCCTRL_CRCSRC_NOACT		0x0
#define DMAC_CRCCTRL_CRCSRC_IO			0x1

	/* 0x04: CRC Data Input */
	uint32_t volatile CRCDATAIN;
	/* CRC Data Input */
#define DMAC_CRCDATAIN_CRCDATAIN_lsb		0u
#define DMAC_CRCDATAIN_CRCDATAIN_msb		31u

	/* 0x08: CRC Checksum */
	uint32_t volatile CRCCHKSUM;
	/* CRC Checksum */
#define DMAC_CRCCHKSUM_CRCCHKSUM_lsb		0u
#define DMAC_CRCCHKSUM_CRCCHKSUM_msb		31u

	/* 0x0C: CRC Status */
	uint8_t volatile CRCSTATUS;
	/* CRC Module Busy */
#define DMAC_CRCSTATUS_CRCBUSY			0u
	/* CRC Zero */
#define DMAC_CRCSTATUS_CRCZERO			1u

	/* 0x0D: Debug Control */
	uint8_t volatile DBGCTRL;
	/* Debug Run */
#define DMAC_DBGCTRL_DBGRUN			0u

	/* 0x0E: QOS Control */
	uint8_t volatile QOSCTRL;
	/* Write-Back Quality of Service */
#define DMAC_QOSCTRL_WRBQOS_lsb			0u
#define DMAC_QOSCTRL_WRBQOS_msb			1u
#define DMAC_QOSCTRL_WRBQOS_DISABLE		0x0
#define DMAC_QOSCTRL_WRBQOS_LOW			0x1
#define DMAC_QOSCTRL_WRBQOS_MEDIUM		0x2
#define DMAC_QOSCTRL_WRBQOS_HIGH		0x3
	/* Fetch Quality of Service */
#define DMAC_QOSCTRL_FQOS_lsb			2u
#define DMAC_QOSCTRL_FQOS_msb			3u
#define DMAC_QOSCTRL_FQOS_DISABLE		0x0
#define DMAC_QOSCTRL_FQOS_LOW			0x1
#define DMAC_QOSCTRL_FQOS_MEDIUM		0x2
#define DMAC_QOSCTRL_FQOS_HIGH			0x3
	/* Data Transfer Quality of Service */
#define DMAC_QOSCTRL_DQOS_lsb			4u
#define DMAC_QOSCTRL_DQOS_msb			5u
#define DMAC_QOSCTRL_DQOS_DISABLE		0x0
#define DMAC_QOSCTRL_DQOS_LOW			0x1
#define DMAC_QOSCTRL_DQOS_MEDIUM		0x2
#define DMAC_QOSCTRL_DQOS_HIGH			0x3

	/* 0x0F */
	uint8_t volatile RESERVED0[0x10-0x0F];

	/* 0x10: Software Trigger Control */
	uint32_t volatile SWTRIGCTRL;
	/* Channel 0 Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG0			0u
	/* Channel 1 Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG1			1u
	/* Channel 2 Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG2			2u
	/* Channel 3 Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG3			3u
	/* Channel 4 Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG4			4u
	/* Channel 5 Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG5			5u

	/* 0x14: Priority Control 0 */
	uint32_t volatile PRICTRL0;
	/* Level 0 Channel Priority Number */
#define DMAC_PRICTRL0_LVLPRI0_lsb		0u
#define DMAC_PRICTRL0_LVLPRI0_msb		2u
	/* Level 0 Round-Robin Scheduling Enable */
#define DMAC_PRICTRL0_RRLVLEN0			7u
	/* Level 1 Channel Priority Number */
#define DMAC_PRICTRL0_LVLPRI1_lsb		8u
#define DMAC_PRICTRL0_LVLPRI1_msb		10u
	/* Level 1 Round-Robin Scheduling Enable */
#define DMAC_PRICTRL0_RRLVLEN1			15u
	/* Level 2 Channel Priority Number */
#define DMAC_PRICTRL0_LVLPRI2_lsb		16u
#define DMAC_PRICTRL0_LVLPRI2_msb		18u
	/* Level 2 Round-Robin Scheduling Enable */
#define DMAC_PRICTRL0_RRLVLEN2			23u
	/* Level 3 Channel Priority Number */
#define DMAC_PRICTRL0_LVLPRI3_lsb		24u
#define DMAC_PRICTRL0_LVLPRI3_msb		26u
	/* Level 3 Round-Robin Scheduling Enable */
#define DMAC_PRICTRL0_RRLVLEN3			31u

	/* 0x18 */
	uint8_t volatile RESERVED1[0x20-0x18];

	/* 0x20: Interrupt Pending */
	uint16_t volatile INTPEND;
	/* Channel ID */
#define DMAC_INTPEND_ID_lsb			0u
#define DMAC_INTPEND_ID_msb			2u
	/* Transfer Error */
#define DMAC_INTPEND_TERR			8u
	/* Transfer Complete */
#define DMAC_INTPEND_TCMPL			9u
	/* Channel Suspend */
#define DMAC_INTPEND_SUSP			10u
	/* Fetch Error */
#define DMAC_INTPEND_FERR			13u
	/* Busy */
#define DMAC_INTPEND_BUSY			14u
	/* Pending */
#define DMAC_INTPEND_PEND			15u

	/* 0x22 */
	uint8_t volatile RESERVED2[0x24-0x22];

	/* 0x24: Interrupt Status */
	uint32_t volatile const INTSTATUS;
	/* Channel 0 Pending Interrupt */
#define DMAC_INTSTATUS_CHINT0			0u
	/* Channel 1 Pending Interrupt */
#define DMAC_INTSTATUS_CHINT1			1u
	/* Channel 2 Pending Interrupt */
#define DMAC_INTSTATUS_CHINT2			2u
	/* Channel 3 Pending Interrupt */
#define DMAC_INTSTATUS_CHINT3			3u
	/* Channel 4 Pending Interrupt */
#define DMAC_INTSTATUS_CHINT4			4u
	/* Channel 5 Pending Interrupt */
#define DMAC_INTSTATUS_CHINT5			5u

