josuah/mcu-samd09/registers.h
	/* 0x28: Busy Channels */
	uint32_t volatile const BUSYCH;
	/* Busy Channel 0 */
#define DMAC_BUSYCH_BUSYCH0			0u
	/* Busy Channel 1 */
#define DMAC_BUSYCH_BUSYCH1			1u
	/* Busy Channel 2 */
#define DMAC_BUSYCH_BUSYCH2			2u
	/* Busy Channel 3 */
#define DMAC_BUSYCH_BUSYCH3			3u
	/* Busy Channel 4 */
#define DMAC_BUSYCH_BUSYCH4			4u
	/* Busy Channel 5 */
#define DMAC_BUSYCH_BUSYCH5			5u

	/* 0x2C: Pending Channels */
	uint32_t volatile const PENDCH;
	/* Pending Channel 0 */
#define DMAC_PENDCH_PENDCH0			0u
	/* Pending Channel 1 */
#define DMAC_PENDCH_PENDCH1			1u
	/* Pending Channel 2 */
#define DMAC_PENDCH_PENDCH2			2u
	/* Pending Channel 3 */
#define DMAC_PENDCH_PENDCH3			3u
	/* Pending Channel 4 */
#define DMAC_PENDCH_PENDCH4			4u
	/* Pending Channel 5 */
#define DMAC_PENDCH_PENDCH5			5u

	/* 0x30: Active Channel and Levels */
	uint32_t volatile const ACTIVE;
	/* Level 0 Channel Trigger Request Executing */
#define DMAC_ACTIVE_LVLEX0			0u
	/* Level 1 Channel Trigger Request Executing */
#define DMAC_ACTIVE_LVLEX1			1u
	/* Level 2 Channel Trigger Request Executing */
#define DMAC_ACTIVE_LVLEX2			2u
	/* Level 3 Channel Trigger Request Executing */
#define DMAC_ACTIVE_LVLEX3			3u
	/* Active Channel ID */
#define DMAC_ACTIVE_ID_lsb			8u
#define DMAC_ACTIVE_ID_msb			12u
	/* Active Channel Busy */
#define DMAC_ACTIVE_ABUSY			15u
	/* Active Channel Block Transfer Count */
#define DMAC_ACTIVE_BTCNT_lsb			16u
#define DMAC_ACTIVE_BTCNT_msb			31u

	/* 0x34: Descriptor Memory Section Base Address */
	uint32_t volatile BASEADDR;
	/* Descriptor Memory Base Address */
#define DMAC_BASEADDR_BASEADDR_lsb		0u
#define DMAC_BASEADDR_BASEADDR_msb		31u

	/* 0x38: Write-Back Memory Section Base Address */
	uint32_t volatile WRBADDR;
	/* Write-Back Memory Base Address */
#define DMAC_WRBADDR_WRBADDR_lsb		0u
#define DMAC_WRBADDR_WRBADDR_msb		31u

	/* 0x3C */
	uint8_t volatile RESERVED3[0x3F-0x3C];

	/* 0x3F: Channel ID */
	uint8_t volatile CHID;
	/* Channel ID */
#define DMAC_CHID_ID_lsb			0u
#define DMAC_CHID_ID_msb			2u

	/* 0x40: Channel Control A */
	uint8_t volatile CHCTRLA;
	/* Channel Software Reset */
#define DMAC_CHCTRLA_SWRST			0u
	/* Channel Enable */
#define DMAC_CHCTRLA_ENABLE			1u

	/* 0x41 */
	uint8_t volatile RESERVED4[0x44-0x41];

	/* 0x44: Channel Control B */
	uint32_t volatile CHCTRLB;
	/* Event Input Action */
#define DMAC_CHCTRLB_EVACT_lsb			0u
#define DMAC_CHCTRLB_EVACT_msb			2u
#define DMAC_CHCTRLB_EVACT_NOACT		0x0
#define DMAC_CHCTRLB_EVACT_TRIG			0x1
#define DMAC_CHCTRLB_EVACT_CTRIG		0x2
#define DMAC_CHCTRLB_EVACT_CBLOCK		0x3
#define DMAC_CHCTRLB_EVACT_SUSPEND		0x4
#define DMAC_CHCTRLB_EVACT_RESUME		0x5
#define DMAC_CHCTRLB_EVACT_SSKIP		0x6
	/* Channel Event Input Enable */
#define DMAC_CHCTRLB_EVIE			3u
	/* Channel Event Output Enable */
#define DMAC_CHCTRLB_EVOE			4u
	/* Channel Arbitration Level */
#define DMAC_CHCTRLB_LVL_lsb			5u
#define DMAC_CHCTRLB_LVL_msb			6u
#define DMAC_CHCTRLB_LVL_LVL0			0x0
#define DMAC_CHCTRLB_LVL_LVL1			0x1
#define DMAC_CHCTRLB_LVL_LVL2			0x2
#define DMAC_CHCTRLB_LVL_LVL3			0x3
	/* Trigger Source */
#define DMAC_CHCTRLB_TRIGSRC_lsb		8u
#define DMAC_CHCTRLB_TRIGSRC_msb		12u
#define DMAC_CHCTRLB_TRIGSRC_DISABLE		0x0
	/* Trigger Action */
#define DMAC_CHCTRLB_TRIGACT_lsb		22u
#define DMAC_CHCTRLB_TRIGACT_msb		23u
#define DMAC_CHCTRLB_TRIGACT_BLOCK		0x0
#define DMAC_CHCTRLB_TRIGACT_BEAT		0x2
#define DMAC_CHCTRLB_TRIGACT_TRANSACTION	0x3
	/* Software Command */
#define DMAC_CHCTRLB_CMD_lsb			24u
#define DMAC_CHCTRLB_CMD_msb			25u
#define DMAC_CHCTRLB_CMD_NOACT			0x0
#define DMAC_CHCTRLB_CMD_SUSPEND		0x1
#define DMAC_CHCTRLB_CMD_RESUME			0x2

	/* 0x48 */
	uint8_t volatile RESERVED5[0x4C-0x48];

	/* 0x4C: Channel Interrupt Enable Clear */
	uint8_t volatile CHINTENCLR;
	/* Channel Transfer Error Interrupt Enable */
#define DMAC_CHINTENCLR_TERR			0u
	/* Channel Transfer Complete Interrupt Enable */
#define DMAC_CHINTENCLR_TCMPL			1u
	/* Channel Suspend Interrupt Enable */
#define DMAC_CHINTENCLR_SUSP			2u

	/* 0x4D: Channel Interrupt Enable Set */
	uint8_t volatile CHINTENSET;
	/* Channel Transfer Error Interrupt Enable */
#define DMAC_CHINTENSET_TERR			0u
	/* Channel Transfer Complete Interrupt Enable */
#define DMAC_CHINTENSET_TCMPL			1u
	/* Channel Suspend Interrupt Enable */
#define DMAC_CHINTENSET_SUSP			2u

	/* 0x4E: Channel Interrupt Flag Status and Clear */
	uint8_t volatile CHINTFLAG;
	/* Channel Transfer Error */
#define DMAC_CHINTFLAG_TERR			0u
	/* Channel Transfer Complete */
#define DMAC_CHINTFLAG_TCMPL			1u
	/* Channel Suspend */
#define DMAC_CHINTFLAG_SUSP			2u

	/* 0x4F: Channel Status */
	uint8_t volatile const CHSTATUS;
	/* Channel Pending */
#define DMAC_CHSTATUS_PEND			0u
	/* Channel Busy */
#define DMAC_CHSTATUS_BUSY			1u
	/* Channel Fetch Error */
#define DMAC_CHSTATUS_FERR			2u

};


#define DSU ((struct zmcu_dsu *)0x41002000)

/* Device Service Unit */
struct zmcu_dsu {

	/* 0x00: Control */
	uint8_t volatile CTRL;
	/* Software Reset */
#define DSU_CTRL_SWRST				0u
	/* 32-bit Cyclic Redundancy Code */
#define DSU_CTRL_CRC				2u
	/* Memory built-in self-test */
#define DSU_CTRL_MBIST				3u
	/* Chip-Erase */
#define DSU_CTRL_CE				4u
	/* Auxiliary Row Read */
#define DSU_CTRL_ARR				6u
	/* Start Memory Stream Access */
#define DSU_CTRL_SMSA				7u

	/* 0x01: Status A */
	uint8_t volatile STATUSA;
	/* Done */
#define DSU_STATUSA_DONE			0u
	/* CPU Reset Phase Extension */
#define DSU_STATUSA_CRSTEXT			1u
	/* Bus Error */
#define DSU_STATUSA_BERR			2u
	/* Failure */
#define DSU_STATUSA_FAIL			3u
	/* Protection Error */
#define DSU_STATUSA_PERR			4u

	/* 0x02: Status B */
	uint8_t volatile const STATUSB;
	/* Protected */
#define DSU_STATUSB_PROT			0u
	/* Debugger Present */
#define DSU_STATUSB_DBGPRES			1u
	/* Debug Communication Channel 0 Dirty */
#define DSU_STATUSB_DCCD0			2u
	/* Debug Communication Channel 1 Dirty */
#define DSU_STATUSB_DCCD1			3u
	/* Hot-Plugging Enable */
#define DSU_STATUSB_HPE				4u

	/* 0x03 */
	uint8_t volatile RESERVED0[0x04-0x03];

	/* 0x04: Address */
	uint32_t volatile ADDR;
	/* Access Mode */
#define DSU_ADDR_AMOD_lsb			0u
#define DSU_ADDR_AMOD_msb			1u
	/* Address */
#define DSU_ADDR_ADDR_lsb			2u
#define DSU_ADDR_ADDR_msb			31u

