josuah/mcu-samd09/registers.h
	/* 0x08: Length */
	uint32_t volatile LENGTH;
	/* Length */
#define DSU_LENGTH_LENGTH_lsb			2u
#define DSU_LENGTH_LENGTH_msb			31u

	/* 0x0C: Data */
	uint32_t volatile DATA;
	/* Data */
#define DSU_DATA_DATA_lsb			0u
#define DSU_DATA_DATA_msb			31u

	/* 0x10: Debug Communication Channel n */
	uint32_t volatile DCC[2];
	/* Data */
#define DSU_DCC_DATA_lsb			0u
#define DSU_DCC_DATA_msb			31u

	/* 0x18: Device Identification */
	uint32_t volatile const DID;
	/* Device Select */
#define DSU_DID_DEVSEL_lsb			0u
#define DSU_DID_DEVSEL_msb			7u
	/* Revision Number */
#define DSU_DID_REVISION_lsb			8u
#define DSU_DID_REVISION_msb			11u
	/* Die Number */
#define DSU_DID_DIE_lsb				12u
#define DSU_DID_DIE_msb				15u
	/* Series */
#define DSU_DID_SERIES_lsb			16u
#define DSU_DID_SERIES_msb			21u
#define DSU_DID_SERIES_0			0x0
#define DSU_DID_SERIES_1			0x1
	/* Family */
#define DSU_DID_FAMILY_lsb			23u
#define DSU_DID_FAMILY_msb			27u
#define DSU_DID_FAMILY_0			0x0
#define DSU_DID_FAMILY_1			0x1
	/* Processor */
#define DSU_DID_PROCESSOR_lsb			28u
#define DSU_DID_PROCESSOR_msb			31u
#define DSU_DID_PROCESSOR_0			0x0
#define DSU_DID_PROCESSOR_1			0x1
#define DSU_DID_PROCESSOR_2			0x2
#define DSU_DID_PROCESSOR_3			0x3

	/* 0x1C */
	uint8_t volatile RESERVED1[0xF0-0x1C];

	/* 0xF0: Device Configuration */
	uint32_t volatile DCFG[2];
	/* Device Configuration */
#define DSU_DCFG_DCFG_lsb			0u
#define DSU_DCFG_DCFG_msb			31u

	/* 0x130 */
	uint8_t volatile RESERVED2[0x1000-0x130];

	/* 0x1000: CoreSight ROM Table Entry 0 */
	uint32_t volatile const ENTRY0;
	/* Entry Present */
#define DSU_ENTRY0_EPRES			0u
	/* Format */
#define DSU_ENTRY0_FMT				1u
	/* Address Offset */
#define DSU_ENTRY0_ADDOFF_lsb			12u
#define DSU_ENTRY0_ADDOFF_msb			31u

	/* 0x1004: CoreSight ROM Table Entry 1 */
	uint32_t volatile const ENTRY1;

	/* 0x1008: CoreSight ROM Table End */
	uint32_t volatile const END;
	/* End Marker */
#define DSU_END_END_lsb				0u
#define DSU_END_END_msb				31u

	/* 0x100C */
	uint8_t volatile RESERVED3[0x1FCC-0x100C];

	/* 0x1FCC: CoreSight ROM Table Memory Type */
	uint32_t volatile const MEMTYPE;
	/* System Memory Present */
#define DSU_MEMTYPE_SMEMP			0u

	/* 0x1FD0: Peripheral Identification 4 */
	uint32_t volatile const PID4;
	/* JEP-106 Continuation Code */
#define DSU_PID4_JEPCC_lsb			0u
#define DSU_PID4_JEPCC_msb			3u
	/* 4KB count */
#define DSU_PID4_FKBC_lsb			4u
#define DSU_PID4_FKBC_msb			7u

	/* 0x1FD4: Peripheral Identification 5 */
	uint32_t volatile const PID5;

	/* 0x1FD8: Peripheral Identification 6 */
	uint32_t volatile const PID6;

	/* 0x1FDC: Peripheral Identification 7 */
	uint32_t volatile const PID7;

	/* 0x1FE0: Peripheral Identification 0 */
	uint32_t volatile const PID0;
	/* Part Number Low */
#define DSU_PID0_PARTNBL_lsb			0u
#define DSU_PID0_PARTNBL_msb			7u

	/* 0x1FE4: Peripheral Identification 1 */
	uint32_t volatile const PID1;
	/* Part Number High */
#define DSU_PID1_PARTNBH_lsb			0u
#define DSU_PID1_PARTNBH_msb			3u
	/* Low part of the JEP-106 Identity Code */
#define DSU_PID1_JEPIDCL_lsb			4u
#define DSU_PID1_JEPIDCL_msb			7u

	/* 0x1FE8: Peripheral Identification 2 */
	uint32_t volatile const PID2;
	/* JEP-106 Identity Code High */
#define DSU_PID2_JEPIDCH_lsb			0u
#define DSU_PID2_JEPIDCH_msb			2u
	/* JEP-106 Identity Code is used */
#define DSU_PID2_JEPU				3u
	/* Revision Number */
#define DSU_PID2_REVISION_lsb			4u
#define DSU_PID2_REVISION_msb			7u

	/* 0x1FEC: Peripheral Identification 3 */
	uint32_t volatile const PID3;
	/* ARM CUSMOD */
#define DSU_PID3_CUSMOD_lsb			0u
#define DSU_PID3_CUSMOD_msb			3u
	/* Revision Number */
#define DSU_PID3_REVAND_lsb			4u
#define DSU_PID3_REVAND_msb			7u

	/* 0x1FF0: Component Identification 0 */
	uint32_t volatile const CID0;
	/* Preamble Byte 0 */
#define DSU_CID0_PREAMBLEB0_lsb			0u
#define DSU_CID0_PREAMBLEB0_msb			7u

	/* 0x1FF4: Component Identification 1 */
	uint32_t volatile const CID1;
	/* Preamble */
#define DSU_CID1_PREAMBLE_lsb			0u
#define DSU_CID1_PREAMBLE_msb			3u
	/* Component Class */
#define DSU_CID1_CCLASS_lsb			4u
#define DSU_CID1_CCLASS_msb			7u

	/* 0x1FF8: Component Identification 2 */
	uint32_t volatile const CID2;
	/* Preamble Byte 2 */
#define DSU_CID2_PREAMBLEB2_lsb			0u
#define DSU_CID2_PREAMBLEB2_msb			7u

	/* 0x1FFC: Component Identification 3 */
	uint32_t volatile const CID3;
	/* Preamble Byte 3 */
#define DSU_CID3_PREAMBLEB3_lsb			0u
#define DSU_CID3_PREAMBLEB3_msb			7u

};


#define EIC ((struct zmcu_eic *)0x40001800)

/* External Interrupt Controller */
struct zmcu_eic {

	/* 0x00: Control */
	uint8_t volatile CTRL;
	/* Software Reset */
#define EIC_CTRL_SWRST				0u
	/* Enable */
#define EIC_CTRL_ENABLE				1u

	/* 0x01: Status */
	uint8_t volatile const STATUS;
	/* Synchronization Busy */
#define EIC_STATUS_SYNCBUSY			7u

	/* 0x02: Non-Maskable Interrupt Control */
	uint8_t volatile NMICTRL;
	/* Non-Maskable Interrupt Sense */
#define EIC_NMICTRL_NMISENSE_lsb		0u
#define EIC_NMICTRL_NMISENSE_msb		2u
#define EIC_NMICTRL_NMISENSE_NONE		0x0
#define EIC_NMICTRL_NMISENSE_RISE		0x1
#define EIC_NMICTRL_NMISENSE_FALL		0x2
#define EIC_NMICTRL_NMISENSE_BOTH		0x3
#define EIC_NMICTRL_NMISENSE_HIGH		0x4
#define EIC_NMICTRL_NMISENSE_LOW		0x5
	/* Non-Maskable Interrupt Filter Enable */
#define EIC_NMICTRL_NMIFILTEN			3u

	/* 0x03: Non-Maskable Interrupt Flag Status and Clear */
	uint8_t volatile NMIFLAG;
	/* Non-Maskable Interrupt */
#define EIC_NMIFLAG_NMI				0u

	/* 0x04: Event Control */
	uint32_t volatile EVCTRL;
	/* External Interrupt 0 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO0			0u
	/* External Interrupt 1 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO1			1u
	/* External Interrupt 2 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO2			2u
	/* External Interrupt 3 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO3			3u
	/* External Interrupt 4 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO4			4u
	/* External Interrupt 5 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO5			5u
	/* External Interrupt 6 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO6			6u
	/* External Interrupt 7 Event Output Enable */
#define EIC_EVCTRL_EXTINTEO7			7u

	/* 0x08: Interrupt Enable Clear */
	uint32_t volatile INTENCLR;
	/* External Interrupt 0 Enable */
#define EIC_INTENCLR_EXTINT0			0u
	/* External Interrupt 1 Enable */
#define EIC_INTENCLR_EXTINT1			1u
	/* External Interrupt 2 Enable */
#define EIC_INTENCLR_EXTINT2			2u
	/* External Interrupt 3 Enable */
#define EIC_INTENCLR_EXTINT3			3u
	/* External Interrupt 4 Enable */
#define EIC_INTENCLR_EXTINT4			4u
	/* External Interrupt 5 Enable */
#define EIC_INTENCLR_EXTINT5			5u
	/* External Interrupt 6 Enable */
#define EIC_INTENCLR_EXTINT6			6u
	/* External Interrupt 7 Enable */
#define EIC_INTENCLR_EXTINT7			7u

