josuah/mcu-samd09/registers.h
	/* 0x0C: Interrupt Enable Set */
	uint32_t volatile INTENSET;
	/* External Interrupt 0 Enable */
#define EIC_INTENSET_EXTINT0			0u
	/* External Interrupt 1 Enable */
#define EIC_INTENSET_EXTINT1			1u
	/* External Interrupt 2 Enable */
#define EIC_INTENSET_EXTINT2			2u
	/* External Interrupt 3 Enable */
#define EIC_INTENSET_EXTINT3			3u
	/* External Interrupt 4 Enable */
#define EIC_INTENSET_EXTINT4			4u
	/* External Interrupt 5 Enable */
#define EIC_INTENSET_EXTINT5			5u
	/* External Interrupt 6 Enable */
#define EIC_INTENSET_EXTINT6			6u
	/* External Interrupt 7 Enable */
#define EIC_INTENSET_EXTINT7			7u

	/* 0x10: Interrupt Flag Status and Clear */
	uint32_t volatile INTFLAG;
	/* External Interrupt 0 */
#define EIC_INTFLAG_EXTINT0			0u
	/* External Interrupt 1 */
#define EIC_INTFLAG_EXTINT1			1u
	/* External Interrupt 2 */
#define EIC_INTFLAG_EXTINT2			2u
	/* External Interrupt 3 */
#define EIC_INTFLAG_EXTINT3			3u
	/* External Interrupt 4 */
#define EIC_INTFLAG_EXTINT4			4u
	/* External Interrupt 5 */
#define EIC_INTFLAG_EXTINT5			5u
	/* External Interrupt 6 */
#define EIC_INTFLAG_EXTINT6			6u
	/* External Interrupt 7 */
#define EIC_INTFLAG_EXTINT7			7u

	/* 0x14: Wake-Up Enable */
	uint32_t volatile WAKEUP;
	/* External Interrupt 0 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN0			0u
	/* External Interrupt 1 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN1			1u
	/* External Interrupt 2 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN2			2u
	/* External Interrupt 3 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN3			3u
	/* External Interrupt 4 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN4			4u
	/* External Interrupt 5 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN5			5u
	/* External Interrupt 6 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN6			6u
	/* External Interrupt 7 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN7			7u

	/* 0x18: Configuration n */
	uint32_t volatile CONFIG;
	/* Input Sense 0 Configuration */
#define EIC_CONFIG_SENSE0_lsb			0u
#define EIC_CONFIG_SENSE0_msb			2u
#define EIC_CONFIG_SENSE0_NONE			0x0
#define EIC_CONFIG_SENSE0_RISE			0x1
#define EIC_CONFIG_SENSE0_FALL			0x2
#define EIC_CONFIG_SENSE0_BOTH			0x3
#define EIC_CONFIG_SENSE0_HIGH			0x4
#define EIC_CONFIG_SENSE0_LOW			0x5
	/* Filter 0 Enable */
#define EIC_CONFIG_FILTEN0			3u
	/* Input Sense 1 Configuration */
#define EIC_CONFIG_SENSE1_lsb			4u
#define EIC_CONFIG_SENSE1_msb			6u
#define EIC_CONFIG_SENSE1_NONE			0x0
#define EIC_CONFIG_SENSE1_RISE			0x1
#define EIC_CONFIG_SENSE1_FALL			0x2
#define EIC_CONFIG_SENSE1_BOTH			0x3
#define EIC_CONFIG_SENSE1_HIGH			0x4
#define EIC_CONFIG_SENSE1_LOW			0x5
	/* Filter 1 Enable */
#define EIC_CONFIG_FILTEN1			7u
	/* Input Sense 2 Configuration */
#define EIC_CONFIG_SENSE2_lsb			8u
#define EIC_CONFIG_SENSE2_msb			10u
#define EIC_CONFIG_SENSE2_NONE			0x0
#define EIC_CONFIG_SENSE2_RISE			0x1
#define EIC_CONFIG_SENSE2_FALL			0x2
#define EIC_CONFIG_SENSE2_BOTH			0x3
#define EIC_CONFIG_SENSE2_HIGH			0x4
#define EIC_CONFIG_SENSE2_LOW			0x5
	/* Filter 2 Enable */
#define EIC_CONFIG_FILTEN2			11u
	/* Input Sense 3 Configuration */
#define EIC_CONFIG_SENSE3_lsb			12u
#define EIC_CONFIG_SENSE3_msb			14u
#define EIC_CONFIG_SENSE3_NONE			0x0
#define EIC_CONFIG_SENSE3_RISE			0x1
#define EIC_CONFIG_SENSE3_FALL			0x2
#define EIC_CONFIG_SENSE3_BOTH			0x3
#define EIC_CONFIG_SENSE3_HIGH			0x4
#define EIC_CONFIG_SENSE3_LOW			0x5
	/* Filter 3 Enable */
#define EIC_CONFIG_FILTEN3			15u
	/* Input Sense 4 Configuration */
#define EIC_CONFIG_SENSE4_lsb			16u
#define EIC_CONFIG_SENSE4_msb			18u
#define EIC_CONFIG_SENSE4_NONE			0x0
#define EIC_CONFIG_SENSE4_RISE			0x1
#define EIC_CONFIG_SENSE4_FALL			0x2
#define EIC_CONFIG_SENSE4_BOTH			0x3
#define EIC_CONFIG_SENSE4_HIGH			0x4
#define EIC_CONFIG_SENSE4_LOW			0x5
	/* Filter 4 Enable */
#define EIC_CONFIG_FILTEN4			19u
	/* Input Sense 5 Configuration */
#define EIC_CONFIG_SENSE5_lsb			20u
#define EIC_CONFIG_SENSE5_msb			22u
#define EIC_CONFIG_SENSE5_NONE			0x0
#define EIC_CONFIG_SENSE5_RISE			0x1
#define EIC_CONFIG_SENSE5_FALL			0x2
#define EIC_CONFIG_SENSE5_BOTH			0x3
#define EIC_CONFIG_SENSE5_HIGH			0x4
#define EIC_CONFIG_SENSE5_LOW			0x5
	/* Filter 5 Enable */
#define EIC_CONFIG_FILTEN5			23u
	/* Input Sense 6 Configuration */
#define EIC_CONFIG_SENSE6_lsb			24u
#define EIC_CONFIG_SENSE6_msb			26u
#define EIC_CONFIG_SENSE6_NONE			0x0
#define EIC_CONFIG_SENSE6_RISE			0x1
#define EIC_CONFIG_SENSE6_FALL			0x2
#define EIC_CONFIG_SENSE6_BOTH			0x3
#define EIC_CONFIG_SENSE6_HIGH			0x4
#define EIC_CONFIG_SENSE6_LOW			0x5
	/* Filter 6 Enable */
#define EIC_CONFIG_FILTEN6			27u
	/* Input Sense 7 Configuration */
#define EIC_CONFIG_SENSE7_lsb			28u
#define EIC_CONFIG_SENSE7_msb			30u
#define EIC_CONFIG_SENSE7_NONE			0x0
#define EIC_CONFIG_SENSE7_RISE			0x1
#define EIC_CONFIG_SENSE7_FALL			0x2
#define EIC_CONFIG_SENSE7_BOTH			0x3
#define EIC_CONFIG_SENSE7_HIGH			0x4
#define EIC_CONFIG_SENSE7_LOW			0x5
	/* Filter 7 Enable */
#define EIC_CONFIG_FILTEN7			31u

};


#define EVSYS ((struct zmcu_evsys *)0x42000400)

/* Event System Interface */
struct zmcu_evsys {

	/* 0x00: Control */
	uint8_t volatile CTRL;
	/* Software Reset */
#define EVSYS_CTRL_SWRST			0u
	/* Generic Clock Requests */
#define EVSYS_CTRL_GCLKREQ			4u

	/* 0x01 */
	uint8_t volatile RESERVED0[0x04-0x01];

	/* 0x04: Channel */
	uint32_t volatile CHANNEL;
	/* Channel Selection */
#define EVSYS_CHANNEL_CHANNEL_lsb		0u
#define EVSYS_CHANNEL_CHANNEL_msb		2u
	/* Software Event */
#define EVSYS_CHANNEL_SWEVT			8u
	/* Event Generator Selection */
#define EVSYS_CHANNEL_EVGEN_lsb			16u
#define EVSYS_CHANNEL_EVGEN_msb			21u
	/* Path Selection */
#define EVSYS_CHANNEL_PATH_lsb			24u
#define EVSYS_CHANNEL_PATH_msb			25u
#define EVSYS_CHANNEL_PATH_SYNCHRONOUS		0x0
#define EVSYS_CHANNEL_PATH_RESYNCHRONIZED	0x1
#define EVSYS_CHANNEL_PATH_ASYNCHRONOUS		0x2
	/* Edge Detection Selection */
#define EVSYS_CHANNEL_EDGSEL_lsb		26u
#define EVSYS_CHANNEL_EDGSEL_msb		27u
#define EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT	0x0
#define EVSYS_CHANNEL_EDGSEL_RISING_EDGE	0x1
#define EVSYS_CHANNEL_EDGSEL_FALLING_EDGE	0x2
#define EVSYS_CHANNEL_EDGSEL_BOTH_EDGES		0x3

	/* 0x08: User Multiplexer */
	uint16_t volatile USER;
	/* User Multiplexer Selection */
#define EVSYS_USER_USER_lsb			0u
#define EVSYS_USER_USER_msb			4u
	/* Channel Event Selection */
#define EVSYS_USER_CHANNEL_lsb			8u
#define EVSYS_USER_CHANNEL_msb			11u
#define EVSYS_USER_CHANNEL_0			0x0

	/* 0x0A */
	uint8_t volatile RESERVED1[0x0C-0x0A];

	/* 0x0C: Channel Status */
	uint32_t volatile const CHSTATUS;
	/* Channel 0 User Ready */
#define EVSYS_CHSTATUS_USRRDY0			0u
	/* Channel 1 User Ready */
#define EVSYS_CHSTATUS_USRRDY1			1u
	/* Channel 2 User Ready */
#define EVSYS_CHSTATUS_USRRDY2			2u
	/* Channel 3 User Ready */
#define EVSYS_CHSTATUS_USRRDY3			3u
	/* Channel 4 User Ready */
#define EVSYS_CHSTATUS_USRRDY4			4u
	/* Channel 5 User Ready */
#define EVSYS_CHSTATUS_USRRDY5			5u
	/* Channel 0 Busy */
#define EVSYS_CHSTATUS_CHBUSY0			8u
	/* Channel 1 Busy */
#define EVSYS_CHSTATUS_CHBUSY1			9u
	/* Channel 2 Busy */
#define EVSYS_CHSTATUS_CHBUSY2			10u
	/* Channel 3 Busy */
#define EVSYS_CHSTATUS_CHBUSY3			11u
	/* Channel 4 Busy */
#define EVSYS_CHSTATUS_CHBUSY4			12u
	/* Channel 5 Busy */
#define EVSYS_CHSTATUS_CHBUSY5			13u

	/* 0x10: Interrupt Enable Clear */
	uint32_t volatile INTENCLR;
	/* Channel 0 Overrun Interrupt Enable */
#define EVSYS_INTENCLR_OVR0			0u
	/* Channel 1 Overrun Interrupt Enable */
#define EVSYS_INTENCLR_OVR1			1u
	/* Channel 2 Overrun Interrupt Enable */
#define EVSYS_INTENCLR_OVR2			2u
	/* Channel 3 Overrun Interrupt Enable */
#define EVSYS_INTENCLR_OVR3			3u
	/* Channel 4 Overrun Interrupt Enable */
#define EVSYS_INTENCLR_OVR4			4u
	/* Channel 5 Overrun Interrupt Enable */
#define EVSYS_INTENCLR_OVR5			5u
	/* Channel 0 Event Detection Interrupt Enable */
#define EVSYS_INTENCLR_EVD0			8u
	/* Channel 1 Event Detection Interrupt Enable */
#define EVSYS_INTENCLR_EVD1			9u
	/* Channel 2 Event Detection Interrupt Enable */
#define EVSYS_INTENCLR_EVD2			10u
	/* Channel 3 Event Detection Interrupt Enable */
#define EVSYS_INTENCLR_EVD3			11u
	/* Channel 4 Event Detection Interrupt Enable */
#define EVSYS_INTENCLR_EVD4			12u
	/* Channel 5 Event Detection Interrupt Enable */
#define EVSYS_INTENCLR_EVD5			13u

	/* 0x14: Interrupt Enable Set */
	uint32_t volatile INTENSET;
	/* Channel 0 Overrun Interrupt Enable */
#define EVSYS_INTENSET_OVR0			0u
	/* Channel 1 Overrun Interrupt Enable */
#define EVSYS_INTENSET_OVR1			1u
	/* Channel 2 Overrun Interrupt Enable */
#define EVSYS_INTENSET_OVR2			2u
	/* Channel 3 Overrun Interrupt Enable */
#define EVSYS_INTENSET_OVR3			3u
	/* Channel 4 Overrun Interrupt Enable */
#define EVSYS_INTENSET_OVR4			4u
	/* Channel 5 Overrun Interrupt Enable */
#define EVSYS_INTENSET_OVR5			5u
	/* Channel 0 Event Detection Interrupt Enable */
#define EVSYS_INTENSET_EVD0			8u
	/* Channel 1 Event Detection Interrupt Enable */
#define EVSYS_INTENSET_EVD1			9u
	/* Channel 2 Event Detection Interrupt Enable */
#define EVSYS_INTENSET_EVD2			10u
	/* Channel 3 Event Detection Interrupt Enable */
#define EVSYS_INTENSET_EVD3			11u
	/* Channel 4 Event Detection Interrupt Enable */
#define EVSYS_INTENSET_EVD4			12u
	/* Channel 5 Event Detection Interrupt Enable */
#define EVSYS_INTENSET_EVD5			13u

