josuah/mcu-samd09/registers.h
	/* 0x18: Interrupt Flag Status and Clear */
	uint32_t volatile INTFLAG;
	/* Channel 0 Overrun */
#define EVSYS_INTFLAG_OVR0			0u
	/* Channel 1 Overrun */
#define EVSYS_INTFLAG_OVR1			1u
	/* Channel 2 Overrun */
#define EVSYS_INTFLAG_OVR2			2u
	/* Channel 3 Overrun */
#define EVSYS_INTFLAG_OVR3			3u
	/* Channel 4 Overrun */
#define EVSYS_INTFLAG_OVR4			4u
	/* Channel 5 Overrun */
#define EVSYS_INTFLAG_OVR5			5u
	/* Channel 0 Event Detection */
#define EVSYS_INTFLAG_EVD0			8u
	/* Channel 1 Event Detection */
#define EVSYS_INTFLAG_EVD1			9u
	/* Channel 2 Event Detection */
#define EVSYS_INTFLAG_EVD2			10u
	/* Channel 3 Event Detection */
#define EVSYS_INTFLAG_EVD3			11u
	/* Channel 4 Event Detection */
#define EVSYS_INTFLAG_EVD4			12u
	/* Channel 5 Event Detection */
#define EVSYS_INTFLAG_EVD5			13u

};


#define GCLK ((struct zmcu_gclk *)0x40000C00)

/* Generic Clock Generator */
struct zmcu_gclk {

	/* 0x00: Control */
	uint8_t volatile CTRL;
	/* Software Reset */
#define GCLK_CTRL_SWRST				0u

	/* 0x01: Status */
	uint8_t volatile const STATUS;
	/* Synchronization Busy Status */
#define GCLK_STATUS_SYNCBUSY			7u

	/* 0x02: Generic Clock Control */
	uint16_t volatile CLKCTRL;
	/* Generic Clock Selection ID */
#define GCLK_CLKCTRL_ID_lsb			0u
#define GCLK_CLKCTRL_ID_msb			5u
#define GCLK_CLKCTRL_ID_DFLL48			0x0
#define GCLK_CLKCTRL_ID_FDPLL			0x1
#define GCLK_CLKCTRL_ID_FDPLL32K		0x2
#define GCLK_CLKCTRL_ID_WDT			0x3
#define GCLK_CLKCTRL_ID_RTC			0x4
#define GCLK_CLKCTRL_ID_EIC			0x5
#define GCLK_CLKCTRL_ID_EVSYS_0			0x7
#define GCLK_CLKCTRL_ID_EVSYS_1			0x8
#define GCLK_CLKCTRL_ID_EVSYS_2			0x9
#define GCLK_CLKCTRL_ID_EVSYS_3			0xA
#define GCLK_CLKCTRL_ID_EVSYS_4			0xB
#define GCLK_CLKCTRL_ID_EVSYS_5			0xC
#define GCLK_CLKCTRL_ID_SERCOMX_SLOW		0xD
#define GCLK_CLKCTRL_ID_SERCOM0_CORE		0xE
#define GCLK_CLKCTRL_ID_SERCOM1_CORE		0xF
#define GCLK_CLKCTRL_ID_SERCOM2_CORE		0x10
#define GCLK_CLKCTRL_ID_TC1_TC2			0x12
#define GCLK_CLKCTRL_ID_ADC			0x13
#define GCLK_CLKCTRL_ID_AC_DIG			0x14
#define GCLK_CLKCTRL_ID_AC_ANA			0x15
	/* Generic Clock Generator */
#define GCLK_CLKCTRL_GEN_lsb			8u
#define GCLK_CLKCTRL_GEN_msb			11u
#define GCLK_CLKCTRL_GEN_GCLKGEN0		0x0
#define GCLK_CLKCTRL_GEN_GCLKGEN1		0x1
#define GCLK_CLKCTRL_GEN_GCLKGEN2		0x2
#define GCLK_CLKCTRL_GEN_GCLKGEN3		0x3
#define GCLK_CLKCTRL_GEN_GCLKGEN4		0x4
#define GCLK_CLKCTRL_GEN_GCLKGEN5		0x5
	/* Clock Enable */
#define GCLK_CLKCTRL_CLKEN			14u
	/* Write Lock */
#define GCLK_CLKCTRL_WRTLOCK			15u

	/* 0x04: Generic Clock Generator Control */
	uint32_t volatile GENCTRL;
	/* Generic Clock Generator Selection */
#define GCLK_GENCTRL_ID_lsb			0u
#define GCLK_GENCTRL_ID_msb			3u
#define GCLK_GENCTRL_ID_GCLKGEN0		0x0
#define GCLK_GENCTRL_ID_GCLKGEN1		0x1
#define GCLK_GENCTRL_ID_GCLKGEN2		0x2
#define GCLK_GENCTRL_ID_GCLKGEN3		0x3
#define GCLK_GENCTRL_ID_GCLKGEN4		0x4
#define GCLK_GENCTRL_ID_GCLKGEN5		0x5
	/* Source Select */
#define GCLK_GENCTRL_SRC_lsb			8u
#define GCLK_GENCTRL_SRC_msb			12u
#define GCLK_GENCTRL_SRC_XOSC			0x0
#define GCLK_GENCTRL_SRC_GCLKIN			0x1
#define GCLK_GENCTRL_SRC_GCLKGEN1		0x2
#define GCLK_GENCTRL_SRC_OSCULP32K		0x3
#define GCLK_GENCTRL_SRC_OSC32K			0x4
#define GCLK_GENCTRL_SRC_XOSC32K		0x5
#define GCLK_GENCTRL_SRC_OSC8M			0x6
#define GCLK_GENCTRL_SRC_DFLL48M		0x7
#define GCLK_GENCTRL_SRC_DPLL96M		0x8
	/* Generic Clock Generator Enable */
#define GCLK_GENCTRL_GENEN			16u
	/* Improve Duty Cycle */
#define GCLK_GENCTRL_IDC			17u
	/* Output Off Value */
#define GCLK_GENCTRL_OOV			18u
	/* Output Enable */
#define GCLK_GENCTRL_OE				19u
	/* Divide Selection */
#define GCLK_GENCTRL_DIVSEL			20u
	/* Run in Standby */
#define GCLK_GENCTRL_RUNSTDBY			21u

	/* 0x08: Generic Clock Generator Division */
	uint32_t volatile GENDIV;
	/* Generic Clock Generator Selection */
#define GCLK_GENDIV_ID_lsb			0u
#define GCLK_GENDIV_ID_msb			3u
#define GCLK_GENDIV_ID_GCLKGEN0			0x0
#define GCLK_GENDIV_ID_GCLKGEN1			0x1
#define GCLK_GENDIV_ID_GCLKGEN2			0x2
#define GCLK_GENDIV_ID_GCLKGEN3			0x3
#define GCLK_GENDIV_ID_GCLKGEN4			0x4
#define GCLK_GENDIV_ID_GCLKGEN5			0x5
	/* Division Factor */
#define GCLK_GENDIV_DIV_lsb			8u
#define GCLK_GENDIV_DIV_msb			23u

};


#define HMATRIX ((struct zmcu_hmatrixb *)0x41007000)

/* HSB Matrix */
struct zmcu_hmatrixb {

	/* 0x0C */
	uint8_t volatile RESERVED0[0x80-0x0C];

	/* 0x80: Priority A for Slave */
	uint64_t volatile PRAS[16];
	/* Master 0 Priority */
#define HMATRIXB_PRAS_M0PR_lsb			0u
#define HMATRIXB_PRAS_M0PR_msb			3u
	/* Master 1 Priority */
#define HMATRIXB_PRAS_M1PR_lsb			4u
#define HMATRIXB_PRAS_M1PR_msb			7u
	/* Master 2 Priority */
#define HMATRIXB_PRAS_M2PR_lsb			8u
#define HMATRIXB_PRAS_M2PR_msb			11u
	/* Master 3 Priority */
#define HMATRIXB_PRAS_M3PR_lsb			12u
#define HMATRIXB_PRAS_M3PR_msb			15u
	/* Master 4 Priority */
#define HMATRIXB_PRAS_M4PR_lsb			16u
#define HMATRIXB_PRAS_M4PR_msb			19u
	/* Master 5 Priority */
#define HMATRIXB_PRAS_M5PR_lsb			20u
#define HMATRIXB_PRAS_M5PR_msb			23u
	/* Master 6 Priority */
#define HMATRIXB_PRAS_M6PR_lsb			24u
#define HMATRIXB_PRAS_M6PR_msb			27u
	/* Master 7 Priority */
#define HMATRIXB_PRAS_M7PR_lsb			28u
#define HMATRIXB_PRAS_M7PR_msb			31u

	/* 0x84: Priority B for Slave */
	uint64_t volatile PRBS[16];
	/* Master 8 Priority */
#define HMATRIXB_PRBS_M8PR_lsb			0u
#define HMATRIXB_PRBS_M8PR_msb			3u
	/* Master 9 Priority */
#define HMATRIXB_PRBS_M9PR_lsb			4u
#define HMATRIXB_PRBS_M9PR_msb			7u
	/* Master 10 Priority */
#define HMATRIXB_PRBS_M10PR_lsb			8u
#define HMATRIXB_PRBS_M10PR_msb			11u
	/* Master 11 Priority */
#define HMATRIXB_PRBS_M11PR_lsb			12u
#define HMATRIXB_PRBS_M11PR_msb			15u
	/* Master 12 Priority */
#define HMATRIXB_PRBS_M12PR_lsb			16u
#define HMATRIXB_PRBS_M12PR_msb			19u
	/* Master 13 Priority */
#define HMATRIXB_PRBS_M13PR_lsb			20u
#define HMATRIXB_PRBS_M13PR_msb			23u
	/* Master 14 Priority */
#define HMATRIXB_PRBS_M14PR_lsb			24u
#define HMATRIXB_PRBS_M14PR_msb			27u
	/* Master 15 Priority */
#define HMATRIXB_PRBS_M15PR_lsb			28u
#define HMATRIXB_PRBS_M15PR_msb			31u

	/* 0x110: Special Function */
	uint32_t volatile SFR[16];
	/* Special Function Register */
#define HMATRIXB_SFR_SFR_lsb			0u
#define HMATRIXB_SFR_SFR_msb			31u

