josuah/mcu-samd09/registers.h
};


#define MTB ((struct zmcu_mtb *)0x41006000)

/* Cortex-M0+ Micro-Trace Buffer */
struct zmcu_mtb {

	/* 0x00: MTB Position */
	uint32_t volatile POSITION;
	/* Pointer Value Wraps */
#define MTB_POSITION_WRAP			2u
	/* Trace Packet Location Pointer */
#define MTB_POSITION_POINTER_lsb		3u
#define MTB_POSITION_POINTER_msb		31u

	/* 0x04: MTB Master */
	uint32_t volatile MASTER;
	/* Maximum Value of the Trace Buffer in SRAM */
#define MTB_MASTER_MASK_lsb			0u
#define MTB_MASTER_MASK_msb			4u
	/* Trace Start Input Enable */
#define MTB_MASTER_TSTARTEN			5u
	/* Trace Stop Input Enable */
#define MTB_MASTER_TSTOPEN			6u
	/* Special Function Register Write Privilege */
#define MTB_MASTER_SFRWPRIV			7u
	/* SRAM Privilege */
#define MTB_MASTER_RAMPRIV			8u
	/* Halt Request */
#define MTB_MASTER_HALTREQ			9u
	/* Main Trace Enable */
#define MTB_MASTER_EN				31u

	/* 0x08: MTB Flow */
	uint32_t volatile FLOW;
	/* Auto Stop Tracing */
#define MTB_FLOW_AUTOSTOP			0u
	/* Auto Halt Request */
#define MTB_FLOW_AUTOHALT			1u
	/* Watermark value */
#define MTB_FLOW_WATERMARK_lsb			3u
#define MTB_FLOW_WATERMARK_msb			31u

	/* 0x0C: MTB Base */
	uint32_t volatile const BASE;

	/* 0x10 */
	uint8_t volatile RESERVED0[0xF00-0x10];

	/* 0xF00: MTB Integration Mode Control */
	uint32_t volatile ITCTRL;

	/* 0xF04 */
	uint8_t volatile RESERVED1[0xFA0-0xF04];

	/* 0xFA0: MTB Claim Set */
	uint32_t volatile CLAIMSET;

	/* 0xFA4: MTB Claim Clear */
	uint32_t volatile CLAIMCLR;

	/* 0xFA8 */
	uint8_t volatile RESERVED2[0xFB0-0xFA8];

	/* 0xFB0: MTB Lock Access */
	uint32_t volatile LOCKACCESS;

	/* 0xFB4: MTB Lock Status */
	uint32_t volatile const LOCKSTATUS;

	/* 0xFB8: MTB Authentication Status */
	uint32_t volatile const AUTHSTATUS;

	/* 0xFBC: MTB Device Architecture */
	uint32_t volatile const DEVARCH;

	/* 0xFC0 */
	uint8_t volatile RESERVED3[0xFC8-0xFC0];

	/* 0xFC8: MTB Device Configuration */
	uint32_t volatile const DEVID;

	/* 0xFCC: MTB Device Type */
	uint32_t volatile const DEVTYPE;

	/* 0xFD0: CoreSight */
	uint32_t volatile const PID4;

	/* 0xFD4: CoreSight */
	uint32_t volatile const PID5;

	/* 0xFD8: CoreSight */
	uint32_t volatile const PID6;

	/* 0xFDC: CoreSight */
	uint32_t volatile const PID7;

	/* 0xFE0: CoreSight */
	uint32_t volatile const PID0;

	/* 0xFE4: CoreSight */
	uint32_t volatile const PID1;

	/* 0xFE8: CoreSight */
	uint32_t volatile const PID2;

	/* 0xFEC: CoreSight */
	uint32_t volatile const PID3;

	/* 0xFF0: CoreSight */
	uint32_t volatile const CID0;

	/* 0xFF4: CoreSight */
	uint32_t volatile const CID1;

	/* 0xFF8: CoreSight */
	uint32_t volatile const CID2;

	/* 0xFFC: CoreSight */
	uint32_t volatile const CID3;

};


#define NVMCTRL ((struct zmcu_nvmctrl *)0x41004000)

/* Non-Volatile Memory Controller */
struct zmcu_nvmctrl {

	/* 0x00: Control A */
	uint16_t volatile CTRLA;
	/* Command */
#define NVMCTRL_CTRLA_CMD_lsb			0u
#define NVMCTRL_CTRLA_CMD_msb			6u
#define NVMCTRL_CTRLA_CMD_ER			0x2
#define NVMCTRL_CTRLA_CMD_WP			0x4
#define NVMCTRL_CTRLA_CMD_EAR			0x5
#define NVMCTRL_CTRLA_CMD_WAP			0x6
#define NVMCTRL_CTRLA_CMD_SF			0xA
#define NVMCTRL_CTRLA_CMD_WL			0xF
#define NVMCTRL_CTRLA_CMD_LR			0x40
#define NVMCTRL_CTRLA_CMD_UR			0x41
#define NVMCTRL_CTRLA_CMD_SPRM			0x42
#define NVMCTRL_CTRLA_CMD_CPRM			0x43
#define NVMCTRL_CTRLA_CMD_PBC			0x44
#define NVMCTRL_CTRLA_CMD_SSB			0x45
#define NVMCTRL_CTRLA_CMD_INVALL		0x46
	/* Command Execution */
#define NVMCTRL_CTRLA_CMDEX_lsb			8u
#define NVMCTRL_CTRLA_CMDEX_msb			15u
#define NVMCTRL_CTRLA_CMDEX_KEY			0xA5

	/* 0x02 */
	uint8_t volatile RESERVED0[0x04-0x02];

	/* 0x04: Control B */
	uint32_t volatile CTRLB;
	/* NVM Read Wait States */
#define NVMCTRL_CTRLB_RWS_lsb			1u
#define NVMCTRL_CTRLB_RWS_msb			4u
#define NVMCTRL_CTRLB_RWS_SINGLE		0x0
#define NVMCTRL_CTRLB_RWS_HALF			0x1
#define NVMCTRL_CTRLB_RWS_DUAL			0x2
	/* Manual Write */
#define NVMCTRL_CTRLB_MANW			7u
	/* Power Reduction Mode during Sleep */
#define NVMCTRL_CTRLB_SLEEPPRM_lsb		8u
#define NVMCTRL_CTRLB_SLEEPPRM_msb		9u
#define NVMCTRL_CTRLB_SLEEPPRM_WAKEONACCESS	0x0
#define NVMCTRL_CTRLB_SLEEPPRM_WAKEUPINSTANT	0x1
#define NVMCTRL_CTRLB_SLEEPPRM_DISABLED		0x3
	/* NVMCTRL Read Mode */
#define NVMCTRL_CTRLB_READMODE_lsb		16u
#define NVMCTRL_CTRLB_READMODE_msb		17u
#define NVMCTRL_CTRLB_READMODE_NO_MISS_PENALTY	0x0
#define NVMCTRL_CTRLB_READMODE_LOW_POWER	0x1
#define NVMCTRL_CTRLB_READMODE_DETERMINISTIC	0x2
	/* Cache Disable */
#define NVMCTRL_CTRLB_CACHEDIS			18u

	/* 0x08: NVM Parameter */
	uint32_t volatile PARAM;
	/* NVM Pages */
#define NVMCTRL_PARAM_NVMP_lsb			0u
#define NVMCTRL_PARAM_NVMP_msb			15u
	/* Page Size */
#define NVMCTRL_PARAM_PSZ_lsb			16u
#define NVMCTRL_PARAM_PSZ_msb			18u
#define NVMCTRL_PARAM_PSZ_8			0x0
#define NVMCTRL_PARAM_PSZ_16			0x1
#define NVMCTRL_PARAM_PSZ_32			0x2
#define NVMCTRL_PARAM_PSZ_64			0x3
#define NVMCTRL_PARAM_PSZ_128			0x4
#define NVMCTRL_PARAM_PSZ_256			0x5
#define NVMCTRL_PARAM_PSZ_512			0x6
#define NVMCTRL_PARAM_PSZ_1024			0x7

	/* 0x0C: Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* NVM Ready Interrupt Enable */
#define NVMCTRL_INTENCLR_READY			0u
	/* Error Interrupt Enable */
#define NVMCTRL_INTENCLR_ERROR			1u

	/* 0x0D */
	uint8_t volatile RESERVED1[0x10-0x0D];

	/* 0x10: Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* NVM Ready Interrupt Enable */
#define NVMCTRL_INTENSET_READY			0u
	/* Error Interrupt Enable */
#define NVMCTRL_INTENSET_ERROR			1u

	/* 0x11 */
	uint8_t volatile RESERVED2[0x14-0x11];

	/* 0x14: Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* NVM Ready */
#define NVMCTRL_INTFLAG_READY			0u
	/* Error */
#define NVMCTRL_INTFLAG_ERROR			1u

	/* 0x15 */
	uint8_t volatile RESERVED3[0x18-0x15];

	/* 0x18: Status */
	uint16_t volatile STATUS;
	/* Power Reduction Mode */
#define NVMCTRL_STATUS_PRM			0u
	/* NVM Page Buffer Active Loading */
#define NVMCTRL_STATUS_LOAD			1u
	/* Programming Error Status */
#define NVMCTRL_STATUS_PROGE			2u
	/* Lock Error Status */
#define NVMCTRL_STATUS_LOCKE			3u
	/* NVM Error */
#define NVMCTRL_STATUS_NVME			4u
	/* Security Bit Status */
#define NVMCTRL_STATUS_SB			8u

	/* 0x1A */
	uint8_t volatile RESERVED4[0x1C-0x1A];

	/* 0x1C: Address */
	uint32_t volatile ADDR;
	/* NVM Address */
#define NVMCTRL_ADDR_ADDR_lsb			0u
#define NVMCTRL_ADDR_ADDR_msb			21u

	/* 0x20: Lock Section */
	uint16_t volatile LOCK;
	/* Region Lock Bits */
#define NVMCTRL_LOCK_LOCK_lsb			0u
#define NVMCTRL_LOCK_LOCK_msb			15u

