josuah/mcu-samd09/registers.h
};


#define PAC0 ((struct zmcu_pac *)0x40000000)
#define PAC1 ((struct zmcu_pac *)0x41000000)
#define PAC2 ((struct zmcu_pac *)0x42000000)

/* Peripheral Access Controller 0 */
struct zmcu_pac {

	/* 0x00: Write Protection Clear */
	uint32_t volatile WPCLR;
	/* Write Protection Clear */
#define PAC_WPCLR_WP_lsb			1u
#define PAC_WPCLR_WP_msb			31u

	/* 0x04: Write Protection Set */
	uint32_t volatile WPSET;
	/* Write Protection Set */
#define PAC_WPSET_WP_lsb			1u
#define PAC_WPSET_WP_msb			31u

};


#define PM ((struct zmcu_pm *)0x40000400)

/* Power Manager */
struct zmcu_pm {

	/* 0x00: Control */
	uint8_t volatile CTRL;
	/* Clock Failure Detector Enable */
#define PM_CTRL_CFDEN				2u
	/* Backup Clock Select */
#define PM_CTRL_BKUPCLK				4u

	/* 0x01: Sleep Mode */
	uint8_t volatile SLEEP;
	/* Idle Mode Configuration */
#define PM_SLEEP_IDLE_lsb			0u
#define PM_SLEEP_IDLE_msb			1u
#define PM_SLEEP_IDLE_CPU			0x0
#define PM_SLEEP_IDLE_AHB			0x1
#define PM_SLEEP_IDLE_APB			0x2

	/* 0x02: External Reset Controller */
	uint8_t volatile EXTCTRL;
	/* External Reset Disable */
#define PM_EXTCTRL_SETDIS			0u

	/* 0x03 */
	uint8_t volatile RESERVED0[0x08-0x03];

	/* 0x08: CPU Clock Select */
	uint8_t volatile CPUSEL;
	/* CPU Prescaler Selection */
#define PM_CPUSEL_CPUDIV_lsb			0u
#define PM_CPUSEL_CPUDIV_msb			2u
#define PM_CPUSEL_CPUDIV_DIV1			0x0
#define PM_CPUSEL_CPUDIV_DIV2			0x1
#define PM_CPUSEL_CPUDIV_DIV4			0x2
#define PM_CPUSEL_CPUDIV_DIV8			0x3
#define PM_CPUSEL_CPUDIV_DIV16			0x4
#define PM_CPUSEL_CPUDIV_DIV32			0x5
#define PM_CPUSEL_CPUDIV_DIV64			0x6
#define PM_CPUSEL_CPUDIV_DIV128			0x7

	/* 0x09: APBA Clock Select */
	uint8_t volatile APBASEL;
	/* APBA Prescaler Selection */
#define PM_APBASEL_APBADIV_lsb			0u
#define PM_APBASEL_APBADIV_msb			2u
#define PM_APBASEL_APBADIV_DIV1			0x0
#define PM_APBASEL_APBADIV_DIV2			0x1
#define PM_APBASEL_APBADIV_DIV4			0x2
#define PM_APBASEL_APBADIV_DIV8			0x3
#define PM_APBASEL_APBADIV_DIV16		0x4
#define PM_APBASEL_APBADIV_DIV32		0x5
#define PM_APBASEL_APBADIV_DIV64		0x6
#define PM_APBASEL_APBADIV_DIV128		0x7

	/* 0x0A: APBB Clock Select */
	uint8_t volatile APBBSEL;
	/* APBB Prescaler Selection */
#define PM_APBBSEL_APBBDIV_lsb			0u
#define PM_APBBSEL_APBBDIV_msb			2u
#define PM_APBBSEL_APBBDIV_DIV1			0x0
#define PM_APBBSEL_APBBDIV_DIV2			0x1
#define PM_APBBSEL_APBBDIV_DIV4			0x2
#define PM_APBBSEL_APBBDIV_DIV8			0x3
#define PM_APBBSEL_APBBDIV_DIV16		0x4
#define PM_APBBSEL_APBBDIV_DIV32		0x5
#define PM_APBBSEL_APBBDIV_DIV64		0x6
#define PM_APBBSEL_APBBDIV_DIV128		0x7

	/* 0x0B: APBC Clock Select */
	uint8_t volatile APBCSEL;
	/* APBC Prescaler Selection */
#define PM_APBCSEL_APBCDIV_lsb			0u
#define PM_APBCSEL_APBCDIV_msb			2u
#define PM_APBCSEL_APBCDIV_DIV1			0x0
#define PM_APBCSEL_APBCDIV_DIV2			0x1
#define PM_APBCSEL_APBCDIV_DIV4			0x2
#define PM_APBCSEL_APBCDIV_DIV8			0x3
#define PM_APBCSEL_APBCDIV_DIV16		0x4
#define PM_APBCSEL_APBCDIV_DIV32		0x5
#define PM_APBCSEL_APBCDIV_DIV64		0x6
#define PM_APBCSEL_APBCDIV_DIV128		0x7

	/* 0x0C */
	uint8_t volatile RESERVED1[0x14-0x0C];

	/* 0x14: AHB Mask */
	uint32_t volatile AHBMASK;
	/* HPB0 AHB Clock Mask */
#define PM_AHBMASK_HPB0				0u
	/* HPB1 AHB Clock Mask */
#define PM_AHBMASK_HPB1				1u
	/* HPB2 AHB Clock Mask */
#define PM_AHBMASK_HPB2				2u
	/* DSU AHB Clock Mask */
#define PM_AHBMASK_DSU				3u
	/* NVMCTRL AHB Clock Mask */
#define PM_AHBMASK_NVMCTRL			4u
	/* DMAC AHB Clock Mask */
#define PM_AHBMASK_DMAC				5u

	/* 0x18: APBA Mask */
	uint32_t volatile APBAMASK;
	/* PAC0 APB Clock Enable */
#define PM_APBAMASK_PAC0			0u
	/* PM APB Clock Enable */
#define PM_APBAMASK_PM				1u
	/* SYSCTRL APB Clock Enable */
#define PM_APBAMASK_SYSCTRL			2u
	/* GCLK APB Clock Enable */
#define PM_APBAMASK_GCLK			3u
	/* WDT APB Clock Enable */
#define PM_APBAMASK_WDT				4u
	/* RTC APB Clock Enable */
#define PM_APBAMASK_RTC				5u
	/* EIC APB Clock Enable */
#define PM_APBAMASK_EIC				6u

	/* 0x1C: APBB Mask */
	uint32_t volatile APBBMASK;
	/* PAC1 APB Clock Enable */
#define PM_APBBMASK_PAC1			0u
	/* DSU APB Clock Enable */
#define PM_APBBMASK_DSU				1u
	/* NVMCTRL APB Clock Enable */
#define PM_APBBMASK_NVMCTRL			2u
	/* PORT APB Clock Enable */
#define PM_APBBMASK_PORT			3u
	/* DMAC APB Clock Enable */
#define PM_APBBMASK_DMAC			4u
	/* HMATRIX APB Clock Enable */
#define PM_APBBMASK_HMATRIX			6u

	/* 0x20: APBC Mask */
	uint32_t volatile APBCMASK;
	/* PAC2 APB Clock Enable */
#define PM_APBCMASK_PAC2			0u
	/* EVSYS APB Clock Enable */
#define PM_APBCMASK_EVSYS			1u
	/* SERCOM0 APB Clock Enable */
#define PM_APBCMASK_SERCOM0			2u
	/* SERCOM1 APB Clock Enable */
#define PM_APBCMASK_SERCOM1			3u
	/* TC1 APB Clock Enable */
#define PM_APBCMASK_TC1				6u
	/* TC2 APB Clock Enable */
#define PM_APBCMASK_TC2				7u
	/* ADC APB Clock Enable */
#define PM_APBCMASK_ADC				8u
	/* PTC APB Clock Enable */
#define PM_APBCMASK_PTC				11u

	/* 0x24 */
	uint8_t volatile RESERVED2[0x34-0x24];

	/* 0x34: Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Clock Ready Interrupt Enable */
#define PM_INTENCLR_CKRDY			0u
	/* Clock Failure Detector Interrupt Enable */
#define PM_INTENCLR_CFD				1u

	/* 0x35: Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Clock Ready Interrupt Enable */
#define PM_INTENSET_CKRDY			0u
	/* Clock Failure Detector Interrupt Enable */
#define PM_INTENSET_CFD				1u

	/* 0x36: Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Clock Ready */
#define PM_INTFLAG_CKRDY			0u
	/* Clock Failure Detector */
#define PM_INTFLAG_CFD				1u

	/* 0x37 */
	uint8_t volatile RESERVED3[0x38-0x37];

	/* 0x38: Reset Cause */
	uint8_t volatile const RCAUSE;
	/* Power On Reset */
#define PM_RCAUSE_POR				0u
	/* Brown Out 12 Detector Reset */
#define PM_RCAUSE_BOD12				1u
	/* Brown Out 33 Detector Reset */
#define PM_RCAUSE_BOD33				2u
	/* External Reset */
#define PM_RCAUSE_EXT				4u
	/* Watchdog Reset */
#define PM_RCAUSE_WDT				5u
	/* System Reset Request */
#define PM_RCAUSE_SYST				6u

};


#define PORT ((struct zmcu_port *)0x41004400)
#define PORT_IOBUS ((struct zmcu_port_iobus *)0x60000000)

/* Port Module */
struct zmcu_port {

	/* 0x00: Data Direction */
	uint32_t volatile DIR;
	/* Port Data Direction */
#define PORT_DIR_DIR_lsb			0u
#define PORT_DIR_DIR_msb			31u

	/* 0x04: Data Direction Clear */
	uint32_t volatile DIRCLR;
	/* Port Data Direction Clear */
#define PORT_DIRCLR_DIRCLR_lsb			0u
#define PORT_DIRCLR_DIRCLR_msb			31u

