josuah/mcu-samd09/registers.h
	/* 0x08: Data Direction Set */
	uint32_t volatile DIRSET;
	/* Port Data Direction Set */
#define PORT_DIRSET_DIRSET_lsb			0u
#define PORT_DIRSET_DIRSET_msb			31u

	/* 0x0C: Data Direction Toggle */
	uint32_t volatile DIRTGL;
	/* Port Data Direction Toggle */
#define PORT_DIRTGL_DIRTGL_lsb			0u
#define PORT_DIRTGL_DIRTGL_msb			31u

	/* 0x10: Data Output Value */
	uint32_t volatile OUT;
	/* Port Data Output Value */
#define PORT_OUT_OUT_lsb			0u
#define PORT_OUT_OUT_msb			31u

	/* 0x14: Data Output Value Clear */
	uint32_t volatile OUTCLR;
	/* Port Data Output Value Clear */
#define PORT_OUTCLR_OUTCLR_lsb			0u
#define PORT_OUTCLR_OUTCLR_msb			31u

	/* 0x18: Data Output Value Set */
	uint32_t volatile OUTSET;
	/* Port Data Output Value Set */
#define PORT_OUTSET_OUTSET_lsb			0u
#define PORT_OUTSET_OUTSET_msb			31u

	/* 0x1C: Data Output Value Toggle */
	uint32_t volatile OUTTGL;
	/* Port Data Output Value Toggle */
#define PORT_OUTTGL_OUTTGL_lsb			0u
#define PORT_OUTTGL_OUTTGL_msb			31u

	/* 0x20: Data Input Value */
	uint32_t volatile const IN;
	/* Port Data Input Value */
#define PORT_IN_IN_lsb				0u
#define PORT_IN_IN_msb				31u

	/* 0x24: Control */
	uint32_t volatile CTRL;
	/* Input Sampling Mode */
#define PORT_CTRL_SAMPLING_lsb			0u
#define PORT_CTRL_SAMPLING_msb			31u

	/* 0x28: Write Configuration */
	uint32_t volatile WRCONFIG;
	/* Pin Mask for Multiple Pin Configuration */
#define PORT_WRCONFIG_PINMASK_lsb		0u
#define PORT_WRCONFIG_PINMASK_msb		15u
	/* Peripheral Multiplexer Enable */
#define PORT_WRCONFIG_PMUXEN			16u
	/* Input Enable */
#define PORT_WRCONFIG_INEN			17u
	/* Pull Enable */
#define PORT_WRCONFIG_PULLEN			18u
	/* Output Driver Strength Selection */
#define PORT_WRCONFIG_DRVSTR			22u
	/* Peripheral Multiplexing */
#define PORT_WRCONFIG_PMUX_lsb			24u
#define PORT_WRCONFIG_PMUX_msb			27u
	/* Write PMUX */
#define PORT_WRCONFIG_WRPMUX			28u
	/* Write PINCFG */
#define PORT_WRCONFIG_WRPINCFG			30u
	/* Half-Word Select */
#define PORT_WRCONFIG_HWSEL			31u

	/* 0x2C */
	uint8_t volatile RESERVED0[0x30-0x2C];

	/* 0x30: Peripheral Multiplexing n - Group 0 */
	uint8_t volatile PMUX[16];
#define PORT_PMUX(pin, x)			((x) << ((pin) % 2))
	/* Peripheral Multiplexing */
#define PORT_PMUX_lsb				0u
#define PORT_PMUX_msb				3u
#define PORT_PMUX_A				0x0
#define PORT_PMUX_EIC				0x0
#define PORT_PMUX_B				0x1
#define PORT_PMUX_REF				0x1
#define PORT_PMUX_ADC				0x2
#define PORT_PMUX_C				0x2
#define PORT_PMUX_SERCOM			0x2
#define PORT_PMUX_D				0x3
#define PORT_PMUX_SERCOM_ALT			0x3
#define PORT_PMUX_E				0x4
#define PORT_PMUX_TC				0x4
#define PORT_PMUX_F				0x5
#define PORT_PMUX_G				0x6
#define PORT_PMUX_COM				0x6
#define PORT_PMUX_H				0x7
#define PORT_PMUX_GCLK				0x7

	/* 0x40: Pin Configuration n */
	uint8_t volatile PINCFG[16];
	/* Peripheral Multiplexer Enable */
#define PORT_PINCFG_PMUXEN			0u
	/* Input Enable */
#define PORT_PINCFG_INEN			1u
	/* Pull Enable */
#define PORT_PINCFG_PULLEN			2u
	/* Output Driver Strength Selection */
#define PORT_PINCFG_DRVSTR			6u

};


#define RTC_MODE0 ((struct zmcu_rtc_mode0 *)0x40001400)

/* RTC: Real-Time Counter: 32-bit Counter with Single 32-bit Compare */
struct zmcu_rtc_mode0 {

	/* 0x00: MODE0 Control */
	uint16_t volatile CTRL;
	/* Software Reset */
#define RTC_MODE0_CTRL_SWRST			0u
	/* Enable */
#define RTC_MODE0_CTRL_ENABLE			1u
	/* Operating Mode */
#define RTC_MODE0_CTRL_MODE_lsb			2u
#define RTC_MODE0_CTRL_MODE_msb			3u
#define RTC_MODE0_CTRL_MODE_COUNT32		0x0
#define RTC_MODE0_CTRL_MODE_COUNT16		0x1
#define RTC_MODE0_CTRL_MODE_CLOCK		0x2
	/* Clear on Match */
#define RTC_MODE0_CTRL_MATCHCLR			7u
	/* Prescaler */
#define RTC_MODE0_CTRL_PRESCALER_lsb		8u
#define RTC_MODE0_CTRL_PRESCALER_msb		11u
#define RTC_MODE0_CTRL_PRESCALER_DIV1		0x0
#define RTC_MODE0_CTRL_PRESCALER_DIV2		0x1
#define RTC_MODE0_CTRL_PRESCALER_DIV4		0x2
#define RTC_MODE0_CTRL_PRESCALER_DIV8		0x3
#define RTC_MODE0_CTRL_PRESCALER_DIV16		0x4
#define RTC_MODE0_CTRL_PRESCALER_DIV32		0x5
#define RTC_MODE0_CTRL_PRESCALER_DIV64		0x6
#define RTC_MODE0_CTRL_PRESCALER_DIV128		0x7
#define RTC_MODE0_CTRL_PRESCALER_DIV256		0x8
#define RTC_MODE0_CTRL_PRESCALER_DIV512		0x9
#define RTC_MODE0_CTRL_PRESCALER_DIV1024	0xA

	/* 0x02: Read Request */
	uint16_t volatile READREQ;
	/* Address */
#define RTC_MODE0_READREQ_ADDR_lsb		0u
#define RTC_MODE0_READREQ_ADDR_msb		5u
	/* Read Continuously */
#define RTC_MODE0_READREQ_RCONT			14u
	/* Read Request */
#define RTC_MODE0_READREQ_RREQ			15u

	/* 0x04: MODE0 Event Control */
	uint16_t volatile EVCTRL;
	/* Periodic Interval 0 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO0			0u
	/* Periodic Interval 1 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO1			1u
	/* Periodic Interval 2 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO2			2u
	/* Periodic Interval 3 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO3			3u
	/* Periodic Interval 4 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO4			4u
	/* Periodic Interval 5 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO5			5u
	/* Periodic Interval 6 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO6			6u
	/* Periodic Interval 7 Event Output Enable */
#define RTC_MODE0_EVCTRL_PEREO7			7u
	/* Compare 0 Event Output Enable */
#define RTC_MODE0_EVCTRL_CMPEO0			8u
	/* Overflow Event Output Enable */
#define RTC_MODE0_EVCTRL_OVFEO			15u

	/* 0x06: MODE0 Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Compare 0 Interrupt Enable */
#define RTC_MODE0_INTENCLR_CMP0			0u
	/* Synchronization Ready Interrupt Enable */
#define RTC_MODE0_INTENCLR_SYNCRDY		6u
	/* Overflow Interrupt Enable */
#define RTC_MODE0_INTENCLR_OVF			7u

	/* 0x07: MODE0 Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Compare 0 Interrupt Enable */
#define RTC_MODE0_INTENSET_CMP0			0u
	/* Synchronization Ready Interrupt Enable */
#define RTC_MODE0_INTENSET_SYNCRDY		6u
	/* Overflow Interrupt Enable */
#define RTC_MODE0_INTENSET_OVF			7u

	/* 0x08: MODE0 Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Compare 0 */
#define RTC_MODE0_INTFLAG_CMP0			0u
	/* Synchronization Ready */
#define RTC_MODE0_INTFLAG_SYNCRDY		6u
	/* Overflow */
#define RTC_MODE0_INTFLAG_OVF			7u

	/* 0x09 */
	uint8_t volatile RESERVED0[0x0A-0x09];

	/* 0x0A: Status */
	uint8_t volatile STATUS;
	/* Synchronization Busy */
#define RTC_MODE0_STATUS_SYNCBUSY		7u

	/* 0x0B: Debug Control */
	uint8_t volatile DBGCTRL;
	/* Run During Debug */
#define RTC_MODE0_DBGCTRL_DBGRUN		0u

	/* 0x0C: Frequency Correction */
	uint8_t volatile FREQCORR;
	/* Correction Value */
#define RTC_MODE0_FREQCORR_VALUE_lsb		0u
#define RTC_MODE0_FREQCORR_VALUE_msb		6u
	/* Correction Sign */
#define RTC_MODE0_FREQCORR_SIGN			7u

	/* 0x0D */
	uint8_t volatile RESERVED1[0x10-0x0D];

