josuah/mcu-samd09/registers.h
	/* 0x10: MODE0 Counter Value */
	uint32_t volatile COUNT;
	/* Counter Value */
#define RTC_MODE0_COUNT_COUNT_lsb		0u
#define RTC_MODE0_COUNT_COUNT_msb		31u

	/* 0x14 */
	uint8_t volatile RESERVED2[0x18-0x14];

	/* 0x18: MODE0 Compare n Value */
	uint32_t volatile COMP;
	/* Compare Value */
#define RTC_MODE0_COMP_COMP_lsb			0u
#define RTC_MODE0_COMP_COMP_msb			31u

};


#define RTC_MODE1 ((struct zmcu_rtc_mode1 *)0x40001400)

/* RTC: Real-Time Counter: 16-bit Counter with Two 16-bit Compares */
struct zmcu_rtc_mode1 {

	/* 0x00: MODE1 Control */
	uint16_t volatile CTRL;
	/* Software Reset */
#define RTC_MODE1_CTRL_SWRST			0u
	/* Enable */
#define RTC_MODE1_CTRL_ENABLE			1u
	/* Operating Mode */
#define RTC_MODE1_CTRL_MODE_lsb			2u
#define RTC_MODE1_CTRL_MODE_msb			3u
#define RTC_MODE1_CTRL_MODE_COUNT32		0x0
#define RTC_MODE1_CTRL_MODE_COUNT16		0x1
#define RTC_MODE1_CTRL_MODE_CLOCK		0x2
	/* Prescaler */
#define RTC_MODE1_CTRL_PRESCALER_lsb		8u
#define RTC_MODE1_CTRL_PRESCALER_msb		11u
#define RTC_MODE1_CTRL_PRESCALER_DIV1		0x0
#define RTC_MODE1_CTRL_PRESCALER_DIV2		0x1
#define RTC_MODE1_CTRL_PRESCALER_DIV4		0x2
#define RTC_MODE1_CTRL_PRESCALER_DIV8		0x3
#define RTC_MODE1_CTRL_PRESCALER_DIV16		0x4
#define RTC_MODE1_CTRL_PRESCALER_DIV32		0x5
#define RTC_MODE1_CTRL_PRESCALER_DIV64		0x6
#define RTC_MODE1_CTRL_PRESCALER_DIV128		0x7
#define RTC_MODE1_CTRL_PRESCALER_DIV256		0x8
#define RTC_MODE1_CTRL_PRESCALER_DIV512		0x9
#define RTC_MODE1_CTRL_PRESCALER_DIV1024	0xA

	/* 0x02: Read Request */
	uint16_t volatile READREQ;
	/* Address */
#define RTC_MODE1_READREQ_ADDR_lsb		0u
#define RTC_MODE1_READREQ_ADDR_msb		5u
	/* Read Continuously */
#define RTC_MODE1_READREQ_RCONT			14u
	/* Read Request */
#define RTC_MODE1_READREQ_RREQ			15u

	/* 0x04: MODE1 Event Control */
	uint16_t volatile EVCTRL;
	/* Periodic Interval 0 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO0			0u
	/* Periodic Interval 1 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO1			1u
	/* Periodic Interval 2 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO2			2u
	/* Periodic Interval 3 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO3			3u
	/* Periodic Interval 4 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO4			4u
	/* Periodic Interval 5 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO5			5u
	/* Periodic Interval 6 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO6			6u
	/* Periodic Interval 7 Event Output Enable */
#define RTC_MODE1_EVCTRL_PEREO7			7u
	/* Compare 0 Event Output Enable */
#define RTC_MODE1_EVCTRL_CMPEO0			8u
	/* Compare 1 Event Output Enable */
#define RTC_MODE1_EVCTRL_CMPEO1			9u
	/* Overflow Event Output Enable */
#define RTC_MODE1_EVCTRL_OVFEO			15u

	/* 0x06: MODE1 Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Compare 0 Interrupt Enable */
#define RTC_MODE1_INTENCLR_CMP0			0u
	/* Compare 1 Interrupt Enable */
#define RTC_MODE1_INTENCLR_CMP1			1u
	/* Synchronization Ready Interrupt Enable */
#define RTC_MODE1_INTENCLR_SYNCRDY		6u
	/* Overflow Interrupt Enable */
#define RTC_MODE1_INTENCLR_OVF			7u

	/* 0x07: MODE1 Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Compare 0 Interrupt Enable */
#define RTC_MODE1_INTENSET_CMP0			0u
	/* Compare 1 Interrupt Enable */
#define RTC_MODE1_INTENSET_CMP1			1u
	/* Synchronization Ready Interrupt Enable */
#define RTC_MODE1_INTENSET_SYNCRDY		6u
	/* Overflow Interrupt Enable */
#define RTC_MODE1_INTENSET_OVF			7u

	/* 0x08: MODE1 Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Compare 0 */
#define RTC_MODE1_INTFLAG_CMP0			0u
	/* Compare 1 */
#define RTC_MODE1_INTFLAG_CMP1			1u
	/* Synchronization Ready */
#define RTC_MODE1_INTFLAG_SYNCRDY		6u
	/* Overflow */
#define RTC_MODE1_INTFLAG_OVF			7u

	/* 0x09 */
	uint8_t volatile RESERVED3[0x0A-0x09];

	/* 0x0A: Status */
	uint8_t volatile STATUS;
	/* Synchronization Busy */
#define RTC_MODE1_STATUS_SYNCBUSY		7u

	/* 0x0B: Debug Control */
	uint8_t volatile DBGCTRL;
	/* Run During Debug */
#define RTC_MODE1_DBGCTRL_DBGRUN		0u

	/* 0x0C: Frequency Correction */
	uint8_t volatile FREQCORR;
	/* Correction Value */
#define RTC_MODE1_FREQCORR_VALUE_lsb		0u
#define RTC_MODE1_FREQCORR_VALUE_msb		6u
	/* Correction Sign */
#define RTC_MODE1_FREQCORR_SIGN			7u

	/* 0x0D */
	uint8_t volatile RESERVED4[0x10-0x0D];

	/* 0x10: MODE1 Counter Value */
	uint16_t volatile COUNT;
	/* Counter Value */
#define RTC_MODE1_COUNT_COUNT_lsb		0u
#define RTC_MODE1_COUNT_COUNT_msb		15u

	/* 0x12 */
	uint8_t volatile RESERVED5[0x14-0x12];

	/* 0x14: MODE1 Counter Period */
	uint16_t volatile PER;
	/* Counter Period */
#define RTC_MODE1_PER_PER_lsb			0u
#define RTC_MODE1_PER_PER_msb			15u

	/* 0x16 */
	uint8_t volatile RESERVED6[0x18-0x16];

	/* 0x18: MODE1 Compare n Value */
	uint16_t volatile COMP[2];
	/* Compare Value */
#define RTC_MODE1_COMP_COMP_lsb			0u
#define RTC_MODE1_COMP_COMP_msb			15u

};


#define RTC_MODE2 ((struct zmcu_rtc_mode2 *)0x40001400)

/* RTC: Real-Time Counter: Clock/Calendar with Alarm */
struct zmcu_rtc_mode2 {

	/* 0x00: MODE2 Control */
	uint16_t volatile CTRL;
	/* Software Reset */
#define RTC_MODE2_CTRL_SWRST			0u
	/* Enable */
#define RTC_MODE2_CTRL_ENABLE			1u
	/* Operating Mode */
#define RTC_MODE2_CTRL_MODE_lsb			2u
#define RTC_MODE2_CTRL_MODE_msb			3u
#define RTC_MODE2_CTRL_MODE_COUNT32		0x0
#define RTC_MODE2_CTRL_MODE_COUNT16		0x1
#define RTC_MODE2_CTRL_MODE_CLOCK		0x2
	/* Clock Representation */
#define RTC_MODE2_CTRL_CLKREP			6u
	/* Clear on Match */
#define RTC_MODE2_CTRL_MATCHCLR			7u
	/* Prescaler */
#define RTC_MODE2_CTRL_PRESCALER_lsb		8u
#define RTC_MODE2_CTRL_PRESCALER_msb		11u
#define RTC_MODE2_CTRL_PRESCALER_DIV1		0x0
#define RTC_MODE2_CTRL_PRESCALER_DIV2		0x1
#define RTC_MODE2_CTRL_PRESCALER_DIV4		0x2
#define RTC_MODE2_CTRL_PRESCALER_DIV8		0x3
#define RTC_MODE2_CTRL_PRESCALER_DIV16		0x4
#define RTC_MODE2_CTRL_PRESCALER_DIV32		0x5
#define RTC_MODE2_CTRL_PRESCALER_DIV64		0x6
#define RTC_MODE2_CTRL_PRESCALER_DIV128		0x7
#define RTC_MODE2_CTRL_PRESCALER_DIV256		0x8
#define RTC_MODE2_CTRL_PRESCALER_DIV512		0x9
#define RTC_MODE2_CTRL_PRESCALER_DIV1024	0xA

	/* 0x02: Read Request */
	uint16_t volatile READREQ;
	/* Address */
#define RTC_MODE2_READREQ_ADDR_lsb		0u
#define RTC_MODE2_READREQ_ADDR_msb		5u
	/* Read Continuously */
#define RTC_MODE2_READREQ_RCONT			14u
	/* Read Request */
#define RTC_MODE2_READREQ_RREQ			15u

	/* 0x04: MODE2 Event Control */
	uint16_t volatile EVCTRL;
	/* Periodic Interval 0 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO0			0u
	/* Periodic Interval 1 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO1			1u
	/* Periodic Interval 2 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO2			2u
	/* Periodic Interval 3 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO3			3u
	/* Periodic Interval 4 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO4			4u
	/* Periodic Interval 5 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO5			5u
	/* Periodic Interval 6 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO6			6u
	/* Periodic Interval 7 Event Output Enable */
#define RTC_MODE2_EVCTRL_PEREO7			7u
	/* Alarm 0 Event Output Enable */
#define RTC_MODE2_EVCTRL_ALARMEO0		8u
	/* Overflow Event Output Enable */
#define RTC_MODE2_EVCTRL_OVFEO			15u

	/* 0x06: MODE2 Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Alarm 0 Interrupt Enable */
#define RTC_MODE2_INTENCLR_ALARM0		0u
	/* Synchronization Ready Interrupt Enable */
#define RTC_MODE2_INTENCLR_SYNCRDY		6u
	/* Overflow Interrupt Enable */
#define RTC_MODE2_INTENCLR_OVF			7u

	/* 0x07: MODE2 Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Alarm 0 Interrupt Enable */
#define RTC_MODE2_INTENSET_ALARM0		0u
	/* Synchronization Ready Interrupt Enable */
#define RTC_MODE2_INTENSET_SYNCRDY		6u
	/* Overflow Interrupt Enable */
#define RTC_MODE2_INTENSET_OVF			7u

	/* 0x08: MODE2 Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Alarm 0 */
#define RTC_MODE2_INTFLAG_ALARM0		0u
	/* Synchronization Ready */
#define RTC_MODE2_INTFLAG_SYNCRDY		6u
	/* Overflow */
#define RTC_MODE2_INTFLAG_OVF			7u

	/* 0x09 */
	uint8_t volatile RESERVED7[0x0A-0x09];

	/* 0x0A: Status */
	uint8_t volatile STATUS;
	/* Synchronization Busy */
#define RTC_MODE2_STATUS_SYNCBUSY		7u

	/* 0x0B: Debug Control */
	uint8_t volatile DBGCTRL;
	/* Run During Debug */
#define RTC_MODE2_DBGCTRL_DBGRUN		0u

	/* 0x0C: Frequency Correction */
	uint8_t volatile FREQCORR;
	/* Correction Value */
#define RTC_MODE2_FREQCORR_VALUE_lsb		0u
#define RTC_MODE2_FREQCORR_VALUE_msb		6u
	/* Correction Sign */
#define RTC_MODE2_FREQCORR_SIGN			7u

	/* 0x0D */
	uint8_t volatile RESERVED8[0x10-0x0D];

	/* 0x10: MODE2 Clock Value */
	uint32_t volatile CLOCK;
	/* Second */
#define RTC_MODE2_CLOCK_SECOND_lsb		0u
#define RTC_MODE2_CLOCK_SECOND_msb		5u
	/* Minute */
#define RTC_MODE2_CLOCK_MINUTE_lsb		6u
#define RTC_MODE2_CLOCK_MINUTE_msb		11u
	/* Hour */
#define RTC_MODE2_CLOCK_HOUR_lsb		12u
#define RTC_MODE2_CLOCK_HOUR_msb		16u
#define RTC_MODE2_CLOCK_HOUR_AM			0x0
#define RTC_MODE2_CLOCK_HOUR_PM			0x10
	/* Day */
#define RTC_MODE2_CLOCK_DAY_lsb			17u
#define RTC_MODE2_CLOCK_DAY_msb			21u
	/* Month */
#define RTC_MODE2_CLOCK_MONTH_lsb		22u
#define RTC_MODE2_CLOCK_MONTH_msb		25u
	/* Year */
#define RTC_MODE2_CLOCK_YEAR_lsb		26u
#define RTC_MODE2_CLOCK_YEAR_msb		31u

	/* 0x14 */
	uint8_t volatile RESERVED9[0x18-0x14];

	/* 0x18: MODE2 Alarm n Value */
	uint32_t volatile ALARM;
	/* Second */
#define RTC_MODE2_ALARM_SECOND_lsb		0u
#define RTC_MODE2_ALARM_SECOND_msb		5u
	/* Minute */
#define RTC_MODE2_ALARM_MINUTE_lsb		6u
#define RTC_MODE2_ALARM_MINUTE_msb		11u
	/* Hour */
#define RTC_MODE2_ALARM_HOUR_lsb		12u
#define RTC_MODE2_ALARM_HOUR_msb		16u
#define RTC_MODE2_ALARM_HOUR_AM			0x0
#define RTC_MODE2_ALARM_HOUR_PM			0x10
	/* Day */
#define RTC_MODE2_ALARM_DAY_lsb			17u
#define RTC_MODE2_ALARM_DAY_msb			21u
	/* Month */
#define RTC_MODE2_ALARM_MONTH_lsb		22u
#define RTC_MODE2_ALARM_MONTH_msb		25u
	/* Year */
#define RTC_MODE2_ALARM_YEAR_lsb		26u
#define RTC_MODE2_ALARM_YEAR_msb		31u

