josuah/mcu-samd09/registers.h
	/* 0x1C: MODE2 Alarm n Mask */
	uint8_t volatile MASK;
	/* Alarm Mask Selection */
#define RTC_MODE2_MASK_SEL_lsb			0u
#define RTC_MODE2_MASK_SEL_msb			2u
#define RTC_MODE2_MASK_SEL_OFF			0x0
#define RTC_MODE2_MASK_SEL_SS			0x1
#define RTC_MODE2_MASK_SEL_MMSS			0x2
#define RTC_MODE2_MASK_SEL_HHMMSS		0x3
#define RTC_MODE2_MASK_SEL_DDHHMMSS		0x4
#define RTC_MODE2_MASK_SEL_MMDDHHMMSS		0x5
#define RTC_MODE2_MASK_SEL_YYMMDDHHMMSS		0x6

};


#define SERCOM0_BASE 0x42000800
#define SERCOM1_BASE 0x42000C00


#define I2CM0 ((struct zmcu_i2cm *)SERCOM0_BASE)
#define I2CM1 ((struct zmcu_i2cm *)SERCOM1_BASE)

/* SERCOM: Serial Communication Interface 0: I2C Master Mode */
struct zmcu_i2cm {

	/* 0x00: I2CM Control A */
	uint32_t volatile CTRLA;
	/* Software Reset */
#define I2CM_CTRLA_SWRST			0u
	/* Enable */
#define I2CM_CTRLA_ENABLE			1u
	/* Operating Mode */
#define I2CM_CTRLA_MODE_lsb			2u
#define I2CM_CTRLA_MODE_msb			4u
#define I2CM_CTRLA_MODE_USART_EXT_CLK		0x0
#define I2CM_CTRLA_MODE_USART_INT_CLK		0x1
#define I2CM_CTRLA_MODE_SPI_SLAVE		0x2
#define I2CM_CTRLA_MODE_SPI_MASTER		0x3
#define I2CM_CTRLA_MODE_I2C_SLAVE		0x4
#define I2CM_CTRLA_MODE_I2C_MASTER		0x5
	/* Run in Standby */
#define I2CM_CTRLA_RUNSTDBY			7u
	/* Pin Usage */
#define I2CM_CTRLA_PINOUT			16u
	/* SDA Hold Time */
#define I2CM_CTRLA_SDAHOLD_lsb			20u
#define I2CM_CTRLA_SDAHOLD_msb			21u
	/* Master SCL Low Extend Timeout */
#define I2CM_CTRLA_MEXTTOEN			22u
	/* Slave SCL Low Extend Timeout */
#define I2CM_CTRLA_SEXTTOEN			23u
	/* Transfer Speed */
#define I2CM_CTRLA_SPEED_lsb			24u
#define I2CM_CTRLA_SPEED_msb			25u
	/* SCL Clock Stretch Mode */
#define I2CM_CTRLA_SCLSM			27u
	/* Inactive Time-Out */
#define I2CM_CTRLA_INACTOUT_lsb			28u
#define I2CM_CTRLA_INACTOUT_msb			29u
	/* SCL Low Timeout Enable */
#define I2CM_CTRLA_LOWTOUTEN			30u

	/* 0x04: I2CM Control B */
	uint32_t volatile CTRLB;
	/* Smart Mode Enable */
#define I2CM_CTRLB_SMEN				8u
	/* Quick Command Enable */
#define I2CM_CTRLB_QCEN				9u
	/* Command */
#define I2CM_CTRLB_CMD_lsb			16u
#define I2CM_CTRLB_CMD_msb			17u
	/* Acknowledge Action */
#define I2CM_CTRLB_ACKACT			18u

	/* 0x08 */
	uint8_t volatile RESERVED0[0x0C-0x08];

	/* 0x0C: I2CM Baud Rate */
	uint32_t volatile BAUD;
	/* Baud Rate Value */
#define I2CM_BAUD_BAUD_lsb			0u
#define I2CM_BAUD_BAUD_msb			7u
	/* Baud Rate Value Low */
#define I2CM_BAUD_BAUDLOW_lsb			8u
#define I2CM_BAUD_BAUDLOW_msb			15u
	/* High Speed Baud Rate Value */
#define I2CM_BAUD_HSBAUD_lsb			16u
#define I2CM_BAUD_HSBAUD_msb			23u
	/* High Speed Baud Rate Value Low */
#define I2CM_BAUD_HSBAUDLOW_lsb			24u
#define I2CM_BAUD_HSBAUDLOW_msb			31u

	/* 0x10 */
	uint8_t volatile RESERVED1[0x14-0x10];

	/* 0x14: I2CM Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Master On Bus Interrupt Disable */
#define I2CM_INTENCLR_MB			0u
	/* Slave On Bus Interrupt Disable */
#define I2CM_INTENCLR_SB			1u
	/* Combined Error Interrupt Disable */
#define I2CM_INTENCLR_ERROR			7u

	/* 0x15 */
	uint8_t volatile RESERVED2[0x16-0x15];

	/* 0x16: I2CM Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Master On Bus Interrupt Enable */
#define I2CM_INTENSET_MB			0u
	/* Slave On Bus Interrupt Enable */
#define I2CM_INTENSET_SB			1u
	/* Combined Error Interrupt Enable */
#define I2CM_INTENSET_ERROR			7u

	/* 0x17 */
	uint8_t volatile RESERVED3[0x18-0x17];

	/* 0x18: I2CM Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Master On Bus Interrupt */
#define I2CM_INTFLAG_MB				0u
	/* Slave On Bus Interrupt */
#define I2CM_INTFLAG_SB				1u
	/* Combined Error Interrupt */
#define I2CM_INTFLAG_ERROR			7u

	/* 0x19 */
	uint8_t volatile RESERVED4[0x1A-0x19];

	/* 0x1A: I2CM Status */
	uint16_t volatile STATUS;
	/* Bus Error */
#define I2CM_STATUS_BUSERR			0u
	/* Arbitration Lost */
#define I2CM_STATUS_ARBLOST			1u
	/* Received Not Acknowledge */
#define I2CM_STATUS_RXNACK			2u
	/* Bus State */
#define I2CM_STATUS_BUSSTATE_lsb		4u
#define I2CM_STATUS_BUSSTATE_msb		5u
	/* SCL Low Timeout */
#define I2CM_STATUS_LOWTOUT			6u
	/* Clock Hold */
#define I2CM_STATUS_CLKHOLD			7u
	/* Master SCL Low Extend Timeout */
#define I2CM_STATUS_MEXTTOUT			8u
	/* Slave SCL Low Extend Timeout */
#define I2CM_STATUS_SEXTTOUT			9u
	/* Length Error */
#define I2CM_STATUS_LENERR			10u

	/* 0x1C: I2CM Syncbusy */
	uint32_t volatile const SYNCBUSY;
	/* Software Reset Synchronization Busy */
#define I2CM_SYNCBUSY_SWRST			0u
	/* SERCOM Enable Synchronization Busy */
#define I2CM_SYNCBUSY_ENABLE			1u
	/* System Operation Synchronization Busy */
#define I2CM_SYNCBUSY_SYSOP			2u

	/* 0x20 */
	uint8_t volatile RESERVED5[0x24-0x20];

	/* 0x24: I2CM Address */
	uint32_t volatile ADDR;
	/* Address Value */
#define I2CM_ADDR_ADDR_lsb			0u
#define I2CM_ADDR_ADDR_msb			10u
	/* Length Enable */
#define I2CM_ADDR_LENEN				13u
	/* High Speed Mode */
#define I2CM_ADDR_HS				14u
	/* Ten Bit Addressing Enable */
#define I2CM_ADDR_TENBITEN			15u
	/* Length */
#define I2CM_ADDR_LEN_lsb			16u
#define I2CM_ADDR_LEN_msb			23u

	/* 0x28: I2CM Data */
	uint8_t volatile DATA;
	/* Data Value */
#define I2CM_DATA_DATA_lsb			0u
#define I2CM_DATA_DATA_msb			7u

	/* 0x29 */
	uint8_t volatile RESERVED6[0x30-0x29];

	/* 0x30: I2CM Debug Control */
	uint8_t volatile DBGCTRL;
	/* Debug Mode */
#define I2CM_DBGCTRL_DBGSTOP			0u

};


#define I2CS0 ((struct zmcu_i2cs *)SERCOM0_BASE)
#define I2CS1 ((struct zmcu_i2cs *)SERCOM1_BASE)

/* SERCOM: Serial Communication Interface 0: I2C Slave Mode */
struct zmcu_i2cs {

	/* 0x00: I2CS Control A */
	uint32_t volatile CTRLA;
	/* Software Reset */
#define I2CS_CTRLA_SWRST			0u
	/* Enable */
#define I2CS_CTRLA_ENABLE			1u
	/* Operating Mode */
#define I2CS_CTRLA_MODE_lsb			2u
#define I2CS_CTRLA_MODE_msb			4u
#define I2CS_CTRLA_MODE_USART_EXT_CLK		0x0
#define I2CS_CTRLA_MODE_USART_INT_CLK		0x1
#define I2CS_CTRLA_MODE_SPI_SLAVE		0x2
#define I2CS_CTRLA_MODE_SPI_MASTER		0x3
#define I2CS_CTRLA_MODE_I2C_SLAVE		0x4
#define I2CS_CTRLA_MODE_I2C_MASTER		0x5
	/* Run during Standby */
#define I2CS_CTRLA_RUNSTDBY			7u
	/* Pin Usage */
#define I2CS_CTRLA_PINOUT			16u
	/* SDA Hold Time */
#define I2CS_CTRLA_SDAHOLD_lsb			20u
#define I2CS_CTRLA_SDAHOLD_msb			21u
	/* Slave SCL Low Extend Timeout */
#define I2CS_CTRLA_SEXTTOEN			23u
	/* Transfer Speed */
#define I2CS_CTRLA_SPEED_lsb			24u
#define I2CS_CTRLA_SPEED_msb			25u
	/* SCL Clock Stretch Mode */
#define I2CS_CTRLA_SCLSM			27u
	/* SCL Low Timeout Enable */
#define I2CS_CTRLA_LOWTOUTEN			30u

