josuah/mcu-samd09/registers.h
	/* 0x04: I2CS Control B */
	uint32_t volatile CTRLB;
	/* Smart Mode Enable */
#define I2CS_CTRLB_SMEN				8u
	/* PMBus Group Command */
#define I2CS_CTRLB_GCMD				9u
	/* Automatic Address Acknowledge */
#define I2CS_CTRLB_AACKEN			10u
	/* Address Mode */
#define I2CS_CTRLB_AMODE_lsb			14u
#define I2CS_CTRLB_AMODE_msb			15u
	/* Command */
#define I2CS_CTRLB_CMD_lsb			16u
#define I2CS_CTRLB_CMD_msb			17u
	/* Acknowledge Action */
#define I2CS_CTRLB_ACKACT			18u

	/* 0x08 */
	uint8_t volatile RESERVED7[0x14-0x08];

	/* 0x14: I2CS Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Stop Received Interrupt Disable */
#define I2CS_INTENCLR_PREC			0u
	/* Address Match Interrupt Disable */
#define I2CS_INTENCLR_AMATCH			1u
	/* Data Interrupt Disable */
#define I2CS_INTENCLR_DRDY			2u
	/* Combined Error Interrupt Disable */
#define I2CS_INTENCLR_ERROR			7u

	/* 0x15 */
	uint8_t volatile RESERVED8[0x16-0x15];

	/* 0x16: I2CS Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Stop Received Interrupt Enable */
#define I2CS_INTENSET_PREC			0u
	/* Address Match Interrupt Enable */
#define I2CS_INTENSET_AMATCH			1u
	/* Data Interrupt Enable */
#define I2CS_INTENSET_DRDY			2u
	/* Combined Error Interrupt Enable */
#define I2CS_INTENSET_ERROR			7u

	/* 0x17 */
	uint8_t volatile RESERVED9[0x18-0x17];

	/* 0x18: I2CS Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Stop Received Interrupt */
#define I2CS_INTFLAG_PREC			0u
	/* Address Match Interrupt */
#define I2CS_INTFLAG_AMATCH			1u
	/* Data Interrupt */
#define I2CS_INTFLAG_DRDY			2u
	/* Combined Error Interrupt */
#define I2CS_INTFLAG_ERROR			7u

	/* 0x19 */
	uint8_t volatile RESERVED10[0x1A-0x19];

	/* 0x1A: I2CS Status */
	uint16_t volatile STATUS;
	/* Bus Error */
#define I2CS_STATUS_BUSERR			0u
	/* Transmit Collision */
#define I2CS_STATUS_COLL			1u
	/* Received Not Acknowledge */
#define I2CS_STATUS_RXNACK			2u
	/* Read/Write Direction */
#define I2CS_STATUS_DIR				3u
	/* Repeated Start */
#define I2CS_STATUS_SR				4u
	/* SCL Low Timeout */
#define I2CS_STATUS_LOWTOUT			6u
	/* Clock Hold */
#define I2CS_STATUS_CLKHOLD			7u
	/* Slave SCL Low Extend Timeout */
#define I2CS_STATUS_SEXTTOUT			9u
	/* High Speed */
#define I2CS_STATUS_HS				10u

	/* 0x1C: I2CS Syncbusy */
	uint32_t volatile const SYNCBUSY;
	/* Software Reset Synchronization Busy */
#define I2CS_SYNCBUSY_SWRST			0u
	/* SERCOM Enable Synchronization Busy */
#define I2CS_SYNCBUSY_ENABLE			1u

	/* 0x20 */
	uint8_t volatile RESERVED11[0x24-0x20];

	/* 0x24: I2CS Address */
	uint32_t volatile ADDR;
	/* General Call Address Enable */
#define I2CS_ADDR_GENCEN			0u
	/* Address Value */
#define I2CS_ADDR_ADDR_lsb			1u
#define I2CS_ADDR_ADDR_msb			10u
	/* Ten Bit Addressing Enable */
#define I2CS_ADDR_TENBITEN			15u
	/* Address Mask */
#define I2CS_ADDR_ADDRMASK_lsb			17u
#define I2CS_ADDR_ADDRMASK_msb			26u

	/* 0x28: I2CS Data */
	uint8_t volatile DATA;
	/* Data Value */
#define I2CS_DATA_DATA_lsb			0u
#define I2CS_DATA_DATA_msb			7u

};


#define SPIS0 ((struct zmcu_spi *)SERCOM0_BASE)
#define SPIS1 ((struct zmcu_spi *)SERCOM1_BASE)

/* SERCOM: Serial Communication Interface 0: SPI Mode */
struct zmcu_spi {

	/* 0x00: SPI Control A */
	uint32_t volatile CTRLA;
	/* Software Reset */
#define SPI_CTRLA_SWRST				0u
	/* Enable */
#define SPI_CTRLA_ENABLE			1u
	/* Operating Mode */
#define SPI_CTRLA_MODE_lsb			2u
#define SPI_CTRLA_MODE_msb			4u
#define SPI_CTRLA_MODE_USART_EXT_CLK		0x0
#define SPI_CTRLA_MODE_USART_INT_CLK		0x1
#define SPI_CTRLA_MODE_SPI_SLAVE		0x2
#define SPI_CTRLA_MODE_SPI_MASTER		0x3
#define SPI_CTRLA_MODE_I2C_SLAVE		0x4
#define SPI_CTRLA_MODE_I2C_MASTER		0x5
	/* Run during Standby */
#define SPI_CTRLA_RUNSTDBY			7u
	/* Immediate Buffer Overflow Notification */
#define SPI_CTRLA_IBON				8u
	/* Data Out Pinout */
#define SPI_CTRLA_DOPO_lsb			16u
#define SPI_CTRLA_DOPO_msb			17u
	/* Data In Pinout */
#define SPI_CTRLA_DIPO_lsb			20u
#define SPI_CTRLA_DIPO_msb			21u
	/* Frame Format */
#define SPI_CTRLA_FORM_lsb			24u
#define SPI_CTRLA_FORM_msb			27u
	/* Clock Phase */
#define SPI_CTRLA_CPHA				28u
	/* Clock Polarity */
#define SPI_CTRLA_CPOL				29u
	/* Data Order */
#define SPI_CTRLA_DORD				30u

	/* 0x04: SPI Control B */
	uint32_t volatile CTRLB;
	/* Character Size */
#define SPI_CTRLB_CHSIZE_lsb			0u
#define SPI_CTRLB_CHSIZE_msb			2u
	/* Data Preload Enable */
#define SPI_CTRLB_PLOADEN			6u
	/* Slave Select Low Detect Enable */
#define SPI_CTRLB_SSDE				9u
	/* Master Slave Select Enable */
#define SPI_CTRLB_MSSEN				13u
	/* Address Mode */
#define SPI_CTRLB_AMODE_lsb			14u
#define SPI_CTRLB_AMODE_msb			15u
	/* Receiver Enable */
#define SPI_CTRLB_RXEN				17u

	/* 0x08 */
	uint8_t volatile RESERVED12[0x0C-0x08];

	/* 0x0C: SPI Baud Rate */
	uint8_t volatile BAUD;
	/* Baud Rate Value */
#define SPI_BAUD_BAUD_lsb			0u
#define SPI_BAUD_BAUD_msb			7u

	/* 0x0D */
	uint8_t volatile RESERVED13[0x14-0x0D];

	/* 0x14: SPI Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Data Register Empty Interrupt Disable */
#define SPI_INTENCLR_DRE			0u
	/* Transmit Complete Interrupt Disable */
#define SPI_INTENCLR_TXC			1u
	/* Receive Complete Interrupt Disable */
#define SPI_INTENCLR_RXC			2u
	/* Slave Select Low Interrupt Disable */
#define SPI_INTENCLR_SSL			3u
	/* Combined Error Interrupt Disable */
#define SPI_INTENCLR_ERROR			7u

	/* 0x15 */
	uint8_t volatile RESERVED14[0x16-0x15];

	/* 0x16: SPI Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Data Register Empty Interrupt Enable */
#define SPI_INTENSET_DRE			0u
	/* Transmit Complete Interrupt Enable */
#define SPI_INTENSET_TXC			1u
	/* Receive Complete Interrupt Enable */
#define SPI_INTENSET_RXC			2u
	/* Slave Select Low Interrupt Enable */
#define SPI_INTENSET_SSL			3u
	/* Combined Error Interrupt Enable */
#define SPI_INTENSET_ERROR			7u

	/* 0x17 */
	uint8_t volatile RESERVED15[0x18-0x17];

	/* 0x18: SPI Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Data Register Empty Interrupt */
#define SPI_INTFLAG_DRE				0u
	/* Transmit Complete Interrupt */
#define SPI_INTFLAG_TXC				1u
	/* Receive Complete Interrupt */
#define SPI_INTFLAG_RXC				2u
	/* Slave Select Low Interrupt Flag */
#define SPI_INTFLAG_SSL				3u
	/* Combined Error Interrupt */
#define SPI_INTFLAG_ERROR			7u

	/* 0x19 */
	uint8_t volatile RESERVED16[0x1A-0x19];

	/* 0x1A: SPI Status */
	uint16_t volatile STATUS;
	/* Buffer Overflow */
#define SPI_STATUS_BUFOVF			2u

