josuah/mcu-samd09/registers.h
	/* 0x1C: SPI Syncbusy */
	uint32_t volatile const SYNCBUSY;
	/* Software Reset Synchronization Busy */
#define SPI_SYNCBUSY_SWRST			0u
	/* SERCOM Enable Synchronization Busy */
#define SPI_SYNCBUSY_ENABLE			1u
	/* CTRLB Synchronization Busy */
#define SPI_SYNCBUSY_CTRLB			2u

	/* 0x20 */
	uint8_t volatile RESERVED17[0x24-0x20];

	/* 0x24: SPI Address */
	uint32_t volatile ADDR;
	/* Address Value */
#define SPI_ADDR_ADDR_lsb			0u
#define SPI_ADDR_ADDR_msb			7u
	/* Address Mask */
#define SPI_ADDR_ADDRMASK_lsb			16u
#define SPI_ADDR_ADDRMASK_msb			23u

	/* 0x28: SPI Data */
	uint32_t volatile DATA;
	/* Data Value */
#define SPI_DATA_DATA_lsb			0u
#define SPI_DATA_DATA_msb			8u

	/* 0x2C */
	uint8_t volatile RESERVED18[0x30-0x2C];

	/* 0x30: SPI Debug Control */
	uint8_t volatile DBGCTRL;
	/* Debug Mode */
#define SPI_DBGCTRL_DBGSTOP			0u

};


#define USART0 ((struct zmcu_usart *)SERCOM0_BASE)
#define USART1 ((struct zmcu_usart *)SERCOM1_BASE)

/* SERCOM: Serial Communication Interface 0: USART Mode */
struct zmcu_usart {

	/* 0x00: USART Control A */
	uint32_t volatile CTRLA;
	/* Software Reset */
#define USART_CTRLA_SWRST			0u
	/* Enable */
#define USART_CTRLA_ENABLE			1u
	/* Operating Mode */
#define USART_CTRLA_MODE_lsb			2u
#define USART_CTRLA_MODE_msb			4u
#define USART_CTRLA_MODE_USART_EXT_CLK		0x0
#define USART_CTRLA_MODE_USART_INT_CLK		0x1
#define USART_CTRLA_MODE_SPI_SLAVE		0x2
#define USART_CTRLA_MODE_SPI_MASTER		0x3
#define USART_CTRLA_MODE_I2C_SLAVE		0x4
#define USART_CTRLA_MODE_I2C_MASTER		0x5
	/* Run during Standby */
#define USART_CTRLA_RUNSTDBY			7u
	/* Immediate Buffer Overflow Notification */
#define USART_CTRLA_IBON			8u
	/* Sample */
#define USART_CTRLA_SAMPR_lsb			13u
#define USART_CTRLA_SAMPR_msb			15u
#define USART_CTRLA_SAMPR_16_ARITHMETIC		0x0
#define USART_CTRLA_SAMPR_16_FRACTIONAL		0x1
#define USART_CTRLA_SAMPR_8_ARITHMETIC		0x2
#define USART_CTRLA_SAMPR_8_FRACTIONAL		0x3
#define USART_CTRLA_SAMPR_3_ARITHMETIC		0x4
	/* Transmit Data Pinout */
#define USART_CTRLA_TXPO_lsb			16u
#define USART_CTRLA_TXPO_msb			17u
#define USART_CTRLA_TXPO_TX0_CK1		0x0
#define USART_CTRLA_TXPO_TX2_CK3		0x1
#define USART_CTRLA_TXPO_TX0_RTS2_CTS3		0x2
	/* Receive Data Pinout */
#define USART_CTRLA_RXPO_lsb			20u
#define USART_CTRLA_RXPO_msb			21u
#define USART_CTRLA_RXPO_RX0			0x0
#define USART_CTRLA_RXPO_RX1			0x1
#define USART_CTRLA_RXPO_RX2			0x2
#define USART_CTRLA_RXPO_RX3			0x3
	/* Sample Adjustment */
#define USART_CTRLA_SAMPA_lsb			22u
#define USART_CTRLA_SAMPA_msb			23u
	/* Frame Format */
#define USART_CTRLA_FORM_lsb			24u
#define USART_CTRLA_FORM_msb			27u
#define USART_CTRLA_FORM_NORMAL_NOPARITY	0x0
#define USART_CTRLA_FORM_NORMAL_PARITY		0x1
#define USART_CTRLA_FORM_AUTOBAUD_NOPARITY	0x2
#define USART_CTRLA_FORM_AUTOBAUD_PARITY	0x3
	/* Communication Mode */
#define USART_CTRLA_CMODE			28u
	/* Clock Polarity */
#define USART_CTRLA_CPOL			29u
	/* Data Order */
#define USART_CTRLA_DORD			30u

	/* 0x04: USART Control B */
	uint32_t volatile CTRLB;
	/* Character Size */
#define USART_CTRLB_CHSIZE_lsb			0u
#define USART_CTRLB_CHSIZE_msb			2u
#define USART_CTRLB_CHSIZE_8BITS		0x0
#define USART_CTRLB_CHSIZE_9BITS		0x1
#define USART_CTRLB_CHSIZE_5BITS		0x5
#define USART_CTRLB_CHSIZE_6BITS		0x6
#define USART_CTRLB_CHSIZE_7BITS		0x7
	/* Stop Bit Mode */
#define USART_CTRLB_SBMODE			6u
	/* Collision Detection Enable */
#define USART_CTRLB_COLDEN			8u
	/* Start of Frame Detection Enable */
#define USART_CTRLB_SFDE			9u
	/* Encoding Format */
#define USART_CTRLB_ENC				10u
	/* Parity Mode */
#define USART_CTRLB_PMODE			13u
	/* Transmitter Enable */
#define USART_CTRLB_TXEN			16u
	/* Receiver Enable */
#define USART_CTRLB_RXEN			17u

	/* 0x08 */
	uint8_t volatile RESERVED19[0x0C-0x08];

	/* 0x0C: USART Baud Rate */
	uint16_t volatile BAUD;
#define USART_BAUD_lsb				0u
#define USART_BAUD_msb				15u
	/* integer part */
#define USART_BAUD_IP_lsb			0u
#define USART_BAUD_IP_msb			12u
	/* Fractional Part */
#define USART_BAUD_FP_lsb			13u
#define USART_BAUD_FP_msb			15u

	/* 0x0E: USART Receive Pulse Length */
	uint8_t volatile RXPL;
	/* Receive Pulse Length */
#define USART_RXPL_RXPL_lsb			0u
#define USART_RXPL_RXPL_msb			7u

	/* 0x0F */
	uint8_t volatile RESERVED20[0x14-0x0F];

	/* 0x14: USART Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Data Register Empty Interrupt Disable */
#define USART_INTENCLR_DRE			0u
	/* Transmit Complete Interrupt Disable */
#define USART_INTENCLR_TXC			1u
	/* Receive Complete Interrupt Disable */
#define USART_INTENCLR_RXC			2u
	/* Receive Start Interrupt Disable */
#define USART_INTENCLR_RXS			3u
	/* Clear To Send Input Change Interrupt Disable */
#define USART_INTENCLR_CTSIC			4u
	/* Break Received Interrupt Disable */
#define USART_INTENCLR_RXBRK			5u
	/* Combined Error Interrupt Disable */
#define USART_INTENCLR_ERROR			7u

	/* 0x15 */
	uint8_t volatile RESERVED21[0x16-0x15];

	/* 0x16: USART Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Data Register Empty Interrupt Enable */
#define USART_INTENSET_DRE			0u
	/* Transmit Complete Interrupt Enable */
#define USART_INTENSET_TXC			1u
	/* Receive Complete Interrupt Enable */
#define USART_INTENSET_RXC			2u
	/* Receive Start Interrupt Enable */
#define USART_INTENSET_RXS			3u
	/* Clear To Send Input Change Interrupt Enable */
#define USART_INTENSET_CTSIC			4u
	/* Break Received Interrupt Enable */
#define USART_INTENSET_RXBRK			5u
	/* Combined Error Interrupt Enable */
#define USART_INTENSET_ERROR			7u

	/* 0x17 */
	uint8_t volatile RESERVED22[0x18-0x17];

	/* 0x18: USART Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Data Register Empty Interrupt */
#define USART_INTFLAG_DRE			0u
	/* Transmit Complete Interrupt */
#define USART_INTFLAG_TXC			1u
	/* Receive Complete Interrupt */
#define USART_INTFLAG_RXC			2u
	/* Receive Start Interrupt */
#define USART_INTFLAG_RXS			3u
	/* Clear To Send Input Change Interrupt */
#define USART_INTFLAG_CTSIC			4u
	/* Break Received Interrupt */
#define USART_INTFLAG_RXBRK			5u
	/* Combined Error Interrupt */
#define USART_INTFLAG_ERROR			7u

	/* 0x19 */
	uint8_t volatile RESERVED23[0x1A-0x19];

	/* 0x1A: USART Status */
	uint16_t volatile STATUS;
	/* Parity Error */
#define USART_STATUS_PERR			0u
	/* Frame Error */
#define USART_STATUS_FERR			1u
	/* Buffer Overflow */
#define USART_STATUS_BUFOVF			2u
	/* Clear To Send */
#define USART_STATUS_CTS			3u
	/* Inconsistent Sync Field */
#define USART_STATUS_ISF			4u
	/* Collision Detected */
#define USART_STATUS_COLL			5u

	/* 0x1C: USART Syncbusy */
	uint32_t volatile const SYNCBUSY;
	/* Software Reset Synchronization Busy */
#define USART_SYNCBUSY_SWRST			0u
	/* SERCOM Enable Synchronization Busy */
#define USART_SYNCBUSY_ENABLE			1u
	/* CTRLB Synchronization Busy */
#define USART_SYNCBUSY_CTRLB			2u

