josuah/mcu-samd09/registers.h
	/* 0x20 */
	uint8_t volatile RESERVED24[0x28-0x20];

	/* 0x28: USART Data */
	uint16_t volatile DATA;
	/* Data Value */
#define USART_DATA_DATA_lsb			0u
#define USART_DATA_DATA_msb			8u

	/* 0x2A */
	uint8_t volatile RESERVED25[0x30-0x2A];

	/* 0x30: USART Debug Control */
	uint8_t volatile DBGCTRL;
	/* Debug Mode */
#define USART_DBGCTRL_DBGSTOP			0u

};


#define SYSCTRL ((struct zmcu_sysctrl *)0x40000800)

/* System Control */
struct zmcu_sysctrl {

	/* 0x00: Interrupt Enable Clear */
	uint32_t volatile INTENCLR;
	/* XOSC Ready Interrupt Enable */
#define SYSCTRL_INTENCLR_XOSCRDY		0u
	/* XOSC32K Ready Interrupt Enable */
#define SYSCTRL_INTENCLR_XOSC32KRDY		1u
	/* OSC32K Ready Interrupt Enable */
#define SYSCTRL_INTENCLR_OSC32KRDY		2u
	/* OSC8M Ready Interrupt Enable */
#define SYSCTRL_INTENCLR_OSC8MRDY		3u
	/* DFLL Ready Interrupt Enable */
#define SYSCTRL_INTENCLR_DFLLRDY		4u
	/* DFLL Out Of Bounds Interrupt Enable */
#define SYSCTRL_INTENCLR_DFLLOOB		5u
	/* DFLL Lock Fine Interrupt Enable */
#define SYSCTRL_INTENCLR_DFLLLCKF		6u
	/* DFLL Lock Coarse Interrupt Enable */
#define SYSCTRL_INTENCLR_DFLLLCKC		7u
	/* DFLL Reference Clock Stopped Interrupt Enable */
#define SYSCTRL_INTENCLR_DFLLRCS		8u
	/* BOD33 Ready Interrupt Enable */
#define SYSCTRL_INTENCLR_BOD33RDY		9u
	/* BOD33 Detection Interrupt Enable */
#define SYSCTRL_INTENCLR_BOD33DET		10u
	/* BOD33 Synchronization Ready Interrupt Enable */
#define SYSCTRL_INTENCLR_B33SRDY		11u
	/* DPLL Lock Rise Interrupt Enable */
#define SYSCTRL_INTENCLR_DPLLLCKR		15u
	/* DPLL Lock Fall Interrupt Enable */
#define SYSCTRL_INTENCLR_DPLLLCKF		16u
	/* DPLL Lock Timeout Interrupt Enable */
#define SYSCTRL_INTENCLR_DPLLLTO		17u

	/* 0x04: Interrupt Enable Set */
	uint32_t volatile INTENSET;
	/* XOSC Ready Interrupt Enable */
#define SYSCTRL_INTENSET_XOSCRDY		0u
	/* XOSC32K Ready Interrupt Enable */
#define SYSCTRL_INTENSET_XOSC32KRDY		1u
	/* OSC32K Ready Interrupt Enable */
#define SYSCTRL_INTENSET_OSC32KRDY		2u
	/* OSC8M Ready Interrupt Enable */
#define SYSCTRL_INTENSET_OSC8MRDY		3u
	/* DFLL Ready Interrupt Enable */
#define SYSCTRL_INTENSET_DFLLRDY		4u
	/* DFLL Out Of Bounds Interrupt Enable */
#define SYSCTRL_INTENSET_DFLLOOB		5u
	/* DFLL Lock Fine Interrupt Enable */
#define SYSCTRL_INTENSET_DFLLLCKF		6u
	/* DFLL Lock Coarse Interrupt Enable */
#define SYSCTRL_INTENSET_DFLLLCKC		7u
	/* DFLL Reference Clock Stopped Interrupt Enable */
#define SYSCTRL_INTENSET_DFLLRCS		8u
	/* BOD33 Ready Interrupt Enable */
#define SYSCTRL_INTENSET_BOD33RDY		9u
	/* BOD33 Detection Interrupt Enable */
#define SYSCTRL_INTENSET_BOD33DET		10u
	/* BOD33 Synchronization Ready Interrupt Enable */
#define SYSCTRL_INTENSET_B33SRDY		11u
	/* DPLL Lock Rise Interrupt Enable */
#define SYSCTRL_INTENSET_DPLLLCKR		15u
	/* DPLL Lock Fall Interrupt Enable */
#define SYSCTRL_INTENSET_DPLLLCKF		16u
	/* DPLL Lock Timeout Interrupt Enable */
#define SYSCTRL_INTENSET_DPLLLTO		17u

	/* 0x08: Interrupt Flag Status and Clear */
	uint32_t volatile INTFLAG;
	/* XOSC Ready */
#define SYSCTRL_INTFLAG_XOSCRDY			0u
	/* XOSC32K Ready */
#define SYSCTRL_INTFLAG_XOSC32KRDY		1u
	/* OSC32K Ready */
#define SYSCTRL_INTFLAG_OSC32KRDY		2u
	/* OSC8M Ready */
#define SYSCTRL_INTFLAG_OSC8MRDY		3u
	/* DFLL Ready */
#define SYSCTRL_INTFLAG_DFLLRDY			4u
	/* DFLL Out Of Bounds */
#define SYSCTRL_INTFLAG_DFLLOOB			5u
	/* DFLL Lock Fine */
#define SYSCTRL_INTFLAG_DFLLLCKF		6u
	/* DFLL Lock Coarse */
#define SYSCTRL_INTFLAG_DFLLLCKC		7u
	/* DFLL Reference Clock Stopped */
#define SYSCTRL_INTFLAG_DFLLRCS			8u
	/* BOD33 Ready */
#define SYSCTRL_INTFLAG_BOD33RDY		9u
	/* BOD33 Detection */
#define SYSCTRL_INTFLAG_BOD33DET		10u
	/* BOD33 Synchronization Ready */
#define SYSCTRL_INTFLAG_B33SRDY			11u
	/* DPLL Lock Rise */
#define SYSCTRL_INTFLAG_DPLLLCKR		15u
	/* DPLL Lock Fall */
#define SYSCTRL_INTFLAG_DPLLLCKF		16u
	/* DPLL Lock Timeout */
#define SYSCTRL_INTFLAG_DPLLLTO			17u

	/* 0x0C: Power and Clocks Status */
	uint32_t volatile const PCLKSR;
	/* XOSC Ready */
#define SYSCTRL_PCLKSR_XOSCRDY			0u
	/* XOSC32K Ready */
#define SYSCTRL_PCLKSR_XOSC32KRDY		1u
	/* OSC32K Ready */
#define SYSCTRL_PCLKSR_OSC32KRDY		2u
	/* OSC8M Ready */
#define SYSCTRL_PCLKSR_OSC8MRDY			3u
	/* DFLL Ready */
#define SYSCTRL_PCLKSR_DFLLRDY			4u
	/* DFLL Out Of Bounds */
#define SYSCTRL_PCLKSR_DFLLOOB			5u
	/* DFLL Lock Fine */
#define SYSCTRL_PCLKSR_DFLLLCKF			6u
	/* DFLL Lock Coarse */
#define SYSCTRL_PCLKSR_DFLLLCKC			7u
	/* DFLL Reference Clock Stopped */
#define SYSCTRL_PCLKSR_DFLLRCS			8u
	/* BOD33 Ready */
#define SYSCTRL_PCLKSR_BOD33RDY			9u
	/* BOD33 Detection */
#define SYSCTRL_PCLKSR_BOD33DET			10u
	/* BOD33 Synchronization Ready */
#define SYSCTRL_PCLKSR_B33SRDY			11u
	/* DPLL Lock Rise */
#define SYSCTRL_PCLKSR_DPLLLCKR			15u
	/* DPLL Lock Fall */
#define SYSCTRL_PCLKSR_DPLLLCKF			16u
	/* DPLL Lock Timeout */
#define SYSCTRL_PCLKSR_DPLLLTO			17u

	/* 0x10: External Multipurpose Crystal Oscillator (XOSC) Control */
	uint16_t volatile XOSC;
	/* Oscillator Enable */
#define SYSCTRL_XOSC_ENABLE			1u
	/* Crystal Oscillator Enable */
#define SYSCTRL_XOSC_XTALEN			2u
	/* Run in Standby */
#define SYSCTRL_XOSC_RUNSTDBY			6u
	/* On Demand Control */
#define SYSCTRL_XOSC_ONDEMAND			7u
	/* Oscillator Gain */
#define SYSCTRL_XOSC_GAIN_lsb			8u
#define SYSCTRL_XOSC_GAIN_msb			10u
#define SYSCTRL_XOSC_GAIN_0			0x0
#define SYSCTRL_XOSC_GAIN_1			0x1
#define SYSCTRL_XOSC_GAIN_2			0x2
#define SYSCTRL_XOSC_GAIN_3			0x3
#define SYSCTRL_XOSC_GAIN_4			0x4
	/* Automatic Amplitude Gain Control */
#define SYSCTRL_XOSC_AMPGC			11u
	/* Start-Up Time */
#define SYSCTRL_XOSC_STARTUP_lsb		12u
#define SYSCTRL_XOSC_STARTUP_msb		15u

	/* 0x12 */
	uint8_t volatile RESERVED0[0x14-0x12];

	/* 0x14: 32kHz External Crystal Oscillator (XOSC32K) Control */
	uint16_t volatile XOSC32K;
	/* Oscillator Enable */
#define SYSCTRL_XOSC32K_ENABLE			1u
	/* Crystal Oscillator Enable */
#define SYSCTRL_XOSC32K_XTALEN			2u
	/* 32kHz Output Enable */
#define SYSCTRL_XOSC32K_EN32K			3u
	/* 1kHz Output Enable */
#define SYSCTRL_XOSC32K_EN1K			4u
	/* Automatic Amplitude Control Enable */
#define SYSCTRL_XOSC32K_AAMPEN			5u
	/* Run in Standby */
#define SYSCTRL_XOSC32K_RUNSTDBY		6u
	/* On Demand Control */
#define SYSCTRL_XOSC32K_ONDEMAND		7u
	/* Oscillator Start-Up Time */
#define SYSCTRL_XOSC32K_STARTUP_lsb		8u
#define SYSCTRL_XOSC32K_STARTUP_msb		10u
	/* Write Lock */
#define SYSCTRL_XOSC32K_WRTLOCK			12u

