josuah/mcu-samd09/registers.h
	/* 0x16 */
	uint8_t volatile RESERVED1[0x18-0x16];

	/* 0x18: 32kHz Internal Oscillator (OSC32K) Control */
	uint32_t volatile OSC32K;
	/* Oscillator Enable */
#define SYSCTRL_OSC32K_ENABLE			1u
	/* 32kHz Output Enable */
#define SYSCTRL_OSC32K_EN32K			2u
	/* 1kHz Output Enable */
#define SYSCTRL_OSC32K_EN1K			3u
	/* Run in Standby */
#define SYSCTRL_OSC32K_RUNSTDBY			6u
	/* On Demand Control */
#define SYSCTRL_OSC32K_ONDEMAND			7u
	/* Oscillator Start-Up Time */
#define SYSCTRL_OSC32K_STARTUP_lsb		8u
#define SYSCTRL_OSC32K_STARTUP_msb		10u
	/* Write Lock */
#define SYSCTRL_OSC32K_WRTLOCK			12u
	/* Oscillator Calibration */
#define SYSCTRL_OSC32K_CALIB_lsb		16u
#define SYSCTRL_OSC32K_CALIB_msb		22u

	/* 0x1C: 32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control */
	uint8_t volatile OSCULP32K;
	/* Oscillator Calibration */
#define SYSCTRL_OSCULP32K_CALIB_lsb		0u
#define SYSCTRL_OSCULP32K_CALIB_msb		4u
	/* Write Lock */
#define SYSCTRL_OSCULP32K_WRTLOCK		7u

	/* 0x1D */
	uint8_t volatile RESERVED2[0x20-0x1D];

	/* 0x20: 8MHz Internal Oscillator (OSC8M) Control */
	uint32_t volatile OSC8M;
	/* Oscillator Enable */
#define SYSCTRL_OSC8M_ENABLE			1u
	/* Run in Standby */
#define SYSCTRL_OSC8M_RUNSTDBY			6u
	/* On Demand Control */
#define SYSCTRL_OSC8M_ONDEMAND			7u
	/* Oscillator Prescaler */
#define SYSCTRL_OSC8M_PRESC_lsb			8u
#define SYSCTRL_OSC8M_PRESC_msb			9u
#define SYSCTRL_OSC8M_PRESC_0			0x0
#define SYSCTRL_OSC8M_PRESC_1			0x1
#define SYSCTRL_OSC8M_PRESC_2			0x2
#define SYSCTRL_OSC8M_PRESC_3			0x3
	/* Oscillator Calibration */
#define SYSCTRL_OSC8M_CALIB_lsb			16u
#define SYSCTRL_OSC8M_CALIB_msb			27u
	/* Oscillator Frequency Range */
#define SYSCTRL_OSC8M_FRANGE_lsb		30u
#define SYSCTRL_OSC8M_FRANGE_msb		31u
#define SYSCTRL_OSC8M_FRANGE_0			0x0
#define SYSCTRL_OSC8M_FRANGE_1			0x1
#define SYSCTRL_OSC8M_FRANGE_2			0x2
#define SYSCTRL_OSC8M_FRANGE_3			0x3

	/* 0x24: DFLL48M Control */
	uint16_t volatile DFLLCTRL;
	/* DFLL Enable */
#define SYSCTRL_DFLLCTRL_ENABLE			1u
	/* Operating Mode Selection */
#define SYSCTRL_DFLLCTRL_MODE			2u
	/* Stable DFLL Frequency */
#define SYSCTRL_DFLLCTRL_STABLE			3u
	/* Lose Lock After Wake */
#define SYSCTRL_DFLLCTRL_LLAW			4u
	/* USB Clock Recovery Mode */
#define SYSCTRL_DFLLCTRL_USBCRM			5u
	/* Run in Standby */
#define SYSCTRL_DFLLCTRL_RUNSTDBY		6u
	/* On Demand Control */
#define SYSCTRL_DFLLCTRL_ONDEMAND		7u
	/* Chill Cycle Disable */
#define SYSCTRL_DFLLCTRL_CCDIS			8u
	/* Quick Lock Disable */
#define SYSCTRL_DFLLCTRL_QLDIS			9u
	/* Bypass Coarse Lock */
#define SYSCTRL_DFLLCTRL_BPLCKC			10u
	/* Wait Lock */
#define SYSCTRL_DFLLCTRL_WAITLOCK		11u

	/* 0x26 */
	uint8_t volatile RESERVED3[0x28-0x26];

	/* 0x28: DFLL48M Value */
	uint32_t volatile DFLLVAL;
	/* Fine Value */
#define SYSCTRL_DFLLVAL_FINE_lsb		0u
#define SYSCTRL_DFLLVAL_FINE_msb		9u
	/* Coarse Value */
#define SYSCTRL_DFLLVAL_COARSE_lsb		10u
#define SYSCTRL_DFLLVAL_COARSE_msb		15u
	/* Multiplication Ratio Difference */
#define SYSCTRL_DFLLVAL_DIFF_lsb		16u
#define SYSCTRL_DFLLVAL_DIFF_msb		31u

	/* 0x2C: DFLL48M Multiplier */
	uint32_t volatile DFLLMUL;
	/* DFLL Multiply Factor */
#define SYSCTRL_DFLLMUL_MUL_lsb			0u
#define SYSCTRL_DFLLMUL_MUL_msb			15u
	/* Fine Maximum Step */
#define SYSCTRL_DFLLMUL_FSTEP_lsb		16u
#define SYSCTRL_DFLLMUL_FSTEP_msb		25u
	/* Coarse Maximum Step */
#define SYSCTRL_DFLLMUL_CSTEP_lsb		26u
#define SYSCTRL_DFLLMUL_CSTEP_msb		31u

	/* 0x30: DFLL48M Synchronization */
	uint8_t volatile DFLLSYNC;
	/* Read Request */
#define SYSCTRL_DFLLSYNC_READREQ		7u

	/* 0x31 */
	uint8_t volatile RESERVED4[0x34-0x31];

	/* 0x34: 3.3V Brown-Out Detector (BOD33) Control */
	uint32_t volatile BOD33;
	/* Enable */
#define SYSCTRL_BOD33_ENABLE			1u
	/* Hysteresis */
#define SYSCTRL_BOD33_HYST			2u
	/* BOD33 Action */
#define SYSCTRL_BOD33_ACTION_lsb		3u
#define SYSCTRL_BOD33_ACTION_msb		4u
#define SYSCTRL_BOD33_ACTION_NONE		0x0
#define SYSCTRL_BOD33_ACTION_RESET		0x1
#define SYSCTRL_BOD33_ACTION_INTERRUPT		0x2
	/* Run in Standby */
#define SYSCTRL_BOD33_RUNSTDBY			6u
	/* Operation Mode */
#define SYSCTRL_BOD33_MODE			8u
	/* Clock Enable */
#define SYSCTRL_BOD33_CEN			9u
	/* Prescaler Select */
#define SYSCTRL_BOD33_PSEL_lsb			12u
#define SYSCTRL_BOD33_PSEL_msb			15u
#define SYSCTRL_BOD33_PSEL_DIV2			0x0
#define SYSCTRL_BOD33_PSEL_DIV4			0x1
#define SYSCTRL_BOD33_PSEL_DIV8			0x2
#define SYSCTRL_BOD33_PSEL_DIV16		0x3
#define SYSCTRL_BOD33_PSEL_DIV32		0x4
#define SYSCTRL_BOD33_PSEL_DIV64		0x5
#define SYSCTRL_BOD33_PSEL_DIV128		0x6
#define SYSCTRL_BOD33_PSEL_DIV256		0x7
#define SYSCTRL_BOD33_PSEL_DIV512		0x8
#define SYSCTRL_BOD33_PSEL_DIV1K		0x9
#define SYSCTRL_BOD33_PSEL_DIV2K		0xA
#define SYSCTRL_BOD33_PSEL_DIV4K		0xB
#define SYSCTRL_BOD33_PSEL_DIV8K		0xC
#define SYSCTRL_BOD33_PSEL_DIV16K		0xD
#define SYSCTRL_BOD33_PSEL_DIV32K		0xE
#define SYSCTRL_BOD33_PSEL_DIV64K		0xF
	/* BOD33 Threshold Level */
#define SYSCTRL_BOD33_LEVEL_lsb			16u
#define SYSCTRL_BOD33_LEVEL_msb			21u

	/* 0x38 */
	uint8_t volatile RESERVED5[0x40-0x38];

	/* 0x40: Voltage References System (VREF) Control */
	uint32_t volatile VREF;
	/* Temperature Sensor Enable */
#define SYSCTRL_VREF_TSEN			1u
	/* Bandgap Output Enable */
#define SYSCTRL_VREF_BGOUTEN			2u
	/* Bandgap Voltage Generator Calibration */
#define SYSCTRL_VREF_CALIB_lsb			16u
#define SYSCTRL_VREF_CALIB_msb			26u

	/* 0x44: DPLL Control A */
	uint8_t volatile DPLLCTRLA;
	/* DPLL Enable */
#define SYSCTRL_DPLLCTRLA_ENABLE		1u
	/* Run in Standby */
#define SYSCTRL_DPLLCTRLA_RUNSTDBY		6u
	/* On Demand Clock Activation */
#define SYSCTRL_DPLLCTRLA_ONDEMAND		7u

	/* 0x45 */
	uint8_t volatile RESERVED6[0x48-0x45];

	/* 0x48: DPLL Ratio Control */
	uint32_t volatile DPLLRATIO;
	/* Loop Divider Ratio */
#define SYSCTRL_DPLLRATIO_LDR_lsb		0u
#define SYSCTRL_DPLLRATIO_LDR_msb		11u
	/* Loop Divider Ratio Fractional Part */
#define SYSCTRL_DPLLRATIO_LDRFRAC_lsb		16u
#define SYSCTRL_DPLLRATIO_LDRFRAC_msb		19u

	/* 0x4C: DPLL Control B */
	uint32_t volatile DPLLCTRLB;
	/* Proportional Integral Filter Selection */
#define SYSCTRL_DPLLCTRLB_FILTER_lsb		0u
#define SYSCTRL_DPLLCTRLB_FILTER_msb		1u
#define SYSCTRL_DPLLCTRLB_FILTER_DEFAULT	0x0
#define SYSCTRL_DPLLCTRLB_FILTER_LBFILT		0x1
#define SYSCTRL_DPLLCTRLB_FILTER_HBFILT		0x2
#define SYSCTRL_DPLLCTRLB_FILTER_HDFILT		0x3
	/* Low-Power Enable */
#define SYSCTRL_DPLLCTRLB_LPEN			2u
	/* Wake Up Fast */
#define SYSCTRL_DPLLCTRLB_WUF			3u
	/* Reference Clock Selection */
#define SYSCTRL_DPLLCTRLB_REFCLK_lsb		4u
#define SYSCTRL_DPLLCTRLB_REFCLK_msb		5u
#define SYSCTRL_DPLLCTRLB_REFCLK_REF0		0x0
#define SYSCTRL_DPLLCTRLB_REFCLK_REF1		0x1
#define SYSCTRL_DPLLCTRLB_REFCLK_GCLK		0x2
	/* Lock Time */
#define SYSCTRL_DPLLCTRLB_LTIME_lsb		8u
#define SYSCTRL_DPLLCTRLB_LTIME_msb		10u
#define SYSCTRL_DPLLCTRLB_LTIME_NONE		0x0
#define SYSCTRL_DPLLCTRLB_LTIME_8MS		0x4
#define SYSCTRL_DPLLCTRLB_LTIME_9MS		0x5
#define SYSCTRL_DPLLCTRLB_LTIME_10MS		0x6
#define SYSCTRL_DPLLCTRLB_LTIME_11MS		0x7
	/* Lock Bypass */
#define SYSCTRL_DPLLCTRLB_LBYPASS		12u
	/* Clock Divider */
#define SYSCTRL_DPLLCTRLB_DIV_lsb		16u
#define SYSCTRL_DPLLCTRLB_DIV_msb		26u

	/* 0x50: DPLL Status */
	uint8_t volatile const DPLLSTATUS;
	/* DPLL Lock Status */
#define SYSCTRL_DPLLSTATUS_LOCK			0u
	/* Output Clock Ready */
#define SYSCTRL_DPLLSTATUS_CLKRDY		1u
	/* DPLL Enable */
#define SYSCTRL_DPLLSTATUS_ENABLE		2u
	/* Divider Enable */
#define SYSCTRL_DPLLSTATUS_DIV			3u

