josuah/mcu-samd09/registers.h
};


#define TC1_COUNT16 ((struct zmcu_tc_count16 *)TC1_BASE)
#define TC2_COUNT16 ((struct zmcu_tc_count16 *)TC2_BASE)

/* TC: Basic Timer Counter 1: 16-bit Counter Mode */
struct zmcu_tc_count16 {

	/* 0x00: Control A */
	uint16_t volatile CTRLA;
	/* Software Reset */
#define TC_COUNT16_CTRLA_SWRST			0u
	/* Enable */
#define TC_COUNT16_CTRLA_ENABLE			1u
	/* TC Mode */
#define TC_COUNT16_CTRLA_MODE_lsb		2u
#define TC_COUNT16_CTRLA_MODE_msb		3u
#define TC_COUNT16_CTRLA_MODE_COUNT16		0x0
#define TC_COUNT16_CTRLA_MODE_COUNT8		0x1
#define TC_COUNT16_CTRLA_MODE_COUNT32		0x2
	/* Waveform Generation Operation */
#define TC_COUNT16_CTRLA_WAVEGEN_lsb		5u
#define TC_COUNT16_CTRLA_WAVEGEN_msb		6u
#define TC_COUNT16_CTRLA_WAVEGEN_NFRQ		0x0
#define TC_COUNT16_CTRLA_WAVEGEN_MFRQ		0x1
#define TC_COUNT16_CTRLA_WAVEGEN_NPWM		0x2
#define TC_COUNT16_CTRLA_WAVEGEN_MPWM		0x3
	/* Prescaler */
#define TC_COUNT16_CTRLA_PRESCALER_lsb		8u
#define TC_COUNT16_CTRLA_PRESCALER_msb		10u
#define TC_COUNT16_CTRLA_PRESCALER_DIV1		0x0
#define TC_COUNT16_CTRLA_PRESCALER_DIV2		0x1
#define TC_COUNT16_CTRLA_PRESCALER_DIV4		0x2
#define TC_COUNT16_CTRLA_PRESCALER_DIV8		0x3
#define TC_COUNT16_CTRLA_PRESCALER_DIV16	0x4
#define TC_COUNT16_CTRLA_PRESCALER_DIV64	0x5
#define TC_COUNT16_CTRLA_PRESCALER_DIV256	0x6
#define TC_COUNT16_CTRLA_PRESCALER_DIV1024	0x7
	/* Run in Standby */
#define TC_COUNT16_CTRLA_RUNSTDBY		11u
	/* Prescaler and Counter Synchronization */
#define TC_COUNT16_CTRLA_PRESCSYNC_lsb		12u
#define TC_COUNT16_CTRLA_PRESCSYNC_msb		13u
#define TC_COUNT16_CTRLA_PRESCSYNC_GCLK		0x0
#define TC_COUNT16_CTRLA_PRESCSYNC_PRESC	0x1
#define TC_COUNT16_CTRLA_PRESCSYNC_RESYNC	0x2

	/* 0x02: Read Request */
	uint16_t volatile READREQ;
	/* Address */
#define TC_COUNT16_READREQ_ADDR_lsb		0u
#define TC_COUNT16_READREQ_ADDR_msb		4u
	/* Read Continuously */
#define TC_COUNT16_READREQ_RCONT		14u
	/* Read Request */
#define TC_COUNT16_READREQ_RREQ			15u

	/* 0x04: Control B Clear */
	uint8_t volatile CTRLBCLR;
	/* Counter Direction */
#define TC_COUNT16_CTRLBCLR_DIR			0u
	/* One-Shot */
#define TC_COUNT16_CTRLBCLR_ONESHOT		2u
	/* Command */
#define TC_COUNT16_CTRLBCLR_CMD_lsb		6u
#define TC_COUNT16_CTRLBCLR_CMD_msb		7u
#define TC_COUNT16_CTRLBCLR_CMD_NONE		0x0
#define TC_COUNT16_CTRLBCLR_CMD_RETRIGGER	0x1
#define TC_COUNT16_CTRLBCLR_CMD_STOP		0x2

	/* 0x05: Control B Set */
	uint8_t volatile CTRLBSET;
	/* Counter Direction */
#define TC_COUNT16_CTRLBSET_DIR			0u
	/* One-Shot */
#define TC_COUNT16_CTRLBSET_ONESHOT		2u
	/* Command */
#define TC_COUNT16_CTRLBSET_CMD_lsb		6u
#define TC_COUNT16_CTRLBSET_CMD_msb		7u
#define TC_COUNT16_CTRLBSET_CMD_NONE		0x0
#define TC_COUNT16_CTRLBSET_CMD_RETRIGGER	0x1
#define TC_COUNT16_CTRLBSET_CMD_STOP		0x2

	/* 0x06: Control C */
	uint8_t volatile CTRLC;
	/* Output Waveform 0 Invert Enable */
#define TC_COUNT16_CTRLC_INVEN0			0u
	/* Output Waveform 1 Invert Enable */
#define TC_COUNT16_CTRLC_INVEN1			1u
	/* Capture Channel 0 Enable */
#define TC_COUNT16_CTRLC_CPTEN0			4u
	/* Capture Channel 1 Enable */
#define TC_COUNT16_CTRLC_CPTEN1			5u

	/* 0x07 */
	uint8_t volatile RESERVED4[0x08-0x07];

	/* 0x08: Debug Control */
	uint8_t volatile DBGCTRL;
	/* Debug Run Mode */
#define TC_COUNT16_DBGCTRL_DBGRUN		0u

	/* 0x09 */
	uint8_t volatile RESERVED5[0x0A-0x09];

	/* 0x0A: Event Control */
	uint16_t volatile EVCTRL;
	/* Event Action */
#define TC_COUNT16_EVCTRL_EVACT_lsb		0u
#define TC_COUNT16_EVCTRL_EVACT_msb		2u
#define TC_COUNT16_EVCTRL_EVACT_OFF		0x0
#define TC_COUNT16_EVCTRL_EVACT_RETRIGGER	0x1
#define TC_COUNT16_EVCTRL_EVACT_COUNT		0x2
#define TC_COUNT16_EVCTRL_EVACT_START		0x3
#define TC_COUNT16_EVCTRL_EVACT_PPW		0x5
#define TC_COUNT16_EVCTRL_EVACT_PWP		0x6
	/* TC Inverted Event Input */
#define TC_COUNT16_EVCTRL_TCINV			4u
	/* TC Event Input */
#define TC_COUNT16_EVCTRL_TCEI			5u
	/* Overflow/Underflow Event Output Enable */
#define TC_COUNT16_EVCTRL_OVFEO			8u
	/* Match or Capture Channel 0 Event Output Enable */
#define TC_COUNT16_EVCTRL_MCEO0			12u
	/* Match or Capture Channel 1 Event Output Enable */
#define TC_COUNT16_EVCTRL_MCEO1			13u

	/* 0x0C: Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Overflow Interrupt Enable */
#define TC_COUNT16_INTENCLR_OVF			0u
	/* Error Interrupt Enable */
#define TC_COUNT16_INTENCLR_ERR			1u
	/* Synchronization Ready Interrupt Enable */
#define TC_COUNT16_INTENCLR_SYNCRDY		3u
	/* Match or Capture Channel 0 Interrupt Enable */
#define TC_COUNT16_INTENCLR_MC0			4u
	/* Match or Capture Channel 1 Interrupt Enable */
#define TC_COUNT16_INTENCLR_MC1			5u

	/* 0x0D: Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Overflow Interrupt Enable */
#define TC_COUNT16_INTENSET_OVF			0u
	/* Error Interrupt Enable */
#define TC_COUNT16_INTENSET_ERR			1u
	/* Synchronization Ready Interrupt Enable */
#define TC_COUNT16_INTENSET_SYNCRDY		3u
	/* Match or Capture Channel 0 Interrupt Enable */
#define TC_COUNT16_INTENSET_MC0			4u
	/* Match or Capture Channel 1 Interrupt Enable */
#define TC_COUNT16_INTENSET_MC1			5u

	/* 0x0E: Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Overflow */
#define TC_COUNT16_INTFLAG_OVF			0u
	/* Error */
#define TC_COUNT16_INTFLAG_ERR			1u
	/* Synchronization Ready */
#define TC_COUNT16_INTFLAG_SYNCRDY		3u
	/* Match or Capture Channel 0 */
#define TC_COUNT16_INTFLAG_MC0			4u
	/* Match or Capture Channel 1 */
#define TC_COUNT16_INTFLAG_MC1			5u

	/* 0x0F: Status */
	uint8_t volatile const STATUS;
	/* Stop */
#define TC_COUNT16_STATUS_STOP			3u
	/* Slave */
#define TC_COUNT16_STATUS_SLAVE			4u
	/* Synchronization Busy */
#define TC_COUNT16_STATUS_SYNCBUSY		7u

	/* 0x10: COUNT16 Counter Value */
	uint16_t volatile COUNT;
	/* Count Value */
#define TC_COUNT16_COUNT_COUNT_lsb		0u
#define TC_COUNT16_COUNT_COUNT_msb		15u

	/* 0x12 */
	uint8_t volatile RESERVED6[0x18-0x12];

	/* 0x18: COUNT16 Compare/Capture */
	uint16_t volatile CC[2];
	/* Compare/Capture Value */
#define TC_COUNT16_CC_CC_lsb			0u
#define TC_COUNT16_CC_CC_msb			15u

