josuah/mcu-samd09/registers.h
};


#define WDT ((struct zmcu_wdt *)0x40001000)

/* Watchdog Timer */
struct zmcu_wdt {

	/* 0x00: Control */
	uint8_t volatile CTRL;
	/* Enable */
#define WDT_CTRL_ENABLE				1u
	/* Watchdog Timer Window Mode Enable */
#define WDT_CTRL_WEN				2u
	/* Always-On */
#define WDT_CTRL_ALWAYSON			7u

	/* 0x01: Configuration */
	uint8_t volatile CONFIG;
	/* Time-Out Period */
#define WDT_CONFIG_PER_lsb			0u
#define WDT_CONFIG_PER_msb			3u
#define WDT_CONFIG_PER_8			0x0
#define WDT_CONFIG_PER_16			0x1
#define WDT_CONFIG_PER_32			0x2
#define WDT_CONFIG_PER_64			0x3
#define WDT_CONFIG_PER_128			0x4
#define WDT_CONFIG_PER_256			0x5
#define WDT_CONFIG_PER_512			0x6
#define WDT_CONFIG_PER_1K			0x7
#define WDT_CONFIG_PER_2K			0x8
#define WDT_CONFIG_PER_4K			0x9
#define WDT_CONFIG_PER_8K			0xA
#define WDT_CONFIG_PER_16K			0xB
	/* Window Mode Time-Out Period */
#define WDT_CONFIG_WINDOW_lsb			4u
#define WDT_CONFIG_WINDOW_msb			7u
#define WDT_CONFIG_WINDOW_8			0x0
#define WDT_CONFIG_WINDOW_16			0x1
#define WDT_CONFIG_WINDOW_32			0x2
#define WDT_CONFIG_WINDOW_64			0x3
#define WDT_CONFIG_WINDOW_128			0x4
#define WDT_CONFIG_WINDOW_256			0x5
#define WDT_CONFIG_WINDOW_512			0x6
#define WDT_CONFIG_WINDOW_1K			0x7
#define WDT_CONFIG_WINDOW_2K			0x8
#define WDT_CONFIG_WINDOW_4K			0x9
#define WDT_CONFIG_WINDOW_8K			0xA
#define WDT_CONFIG_WINDOW_16K			0xB

	/* 0x02: Early Warning Interrupt Control */
	uint8_t volatile EWCTRL;
	/* Early Warning Interrupt Time Offset */
#define WDT_EWCTRL_EWOFFSET_lsb			0u
#define WDT_EWCTRL_EWOFFSET_msb			3u
#define WDT_EWCTRL_EWOFFSET_8			0x0
#define WDT_EWCTRL_EWOFFSET_16			0x1
#define WDT_EWCTRL_EWOFFSET_32			0x2
#define WDT_EWCTRL_EWOFFSET_64			0x3
#define WDT_EWCTRL_EWOFFSET_128			0x4
#define WDT_EWCTRL_EWOFFSET_256			0x5
#define WDT_EWCTRL_EWOFFSET_512			0x6
#define WDT_EWCTRL_EWOFFSET_1K			0x7
#define WDT_EWCTRL_EWOFFSET_2K			0x8
#define WDT_EWCTRL_EWOFFSET_4K			0x9
#define WDT_EWCTRL_EWOFFSET_8K			0xA
#define WDT_EWCTRL_EWOFFSET_16K			0xB

	/* 0x03 */
	uint8_t volatile RESERVED0[0x04-0x03];

	/* 0x04: Interrupt Enable Clear */
	uint8_t volatile INTENCLR;
	/* Early Warning Interrupt Enable */
#define WDT_INTENCLR_EW				0u

	/* 0x05: Interrupt Enable Set */
	uint8_t volatile INTENSET;
	/* Early Warning Interrupt Enable */
#define WDT_INTENSET_EW				0u

	/* 0x06: Interrupt Flag Status and Clear */
	uint8_t volatile INTFLAG;
	/* Early Warning */
#define WDT_INTFLAG_EW				0u

	/* 0x07: Status */
	uint8_t volatile const STATUS;
	/* Synchronization Busy */
#define WDT_STATUS_SYNCBUSY			7u

	/* 0x08: Clear */
	uint8_t volatile CLEAR;
	/* Watchdog Clear */
#define WDT_CLEAR_CLEAR_lsb			0u
#define WDT_CLEAR_CLEAR_msb			7u

};
